ataradov/mcu-starter-projects/samg53/include/component/adc.h
/**
 * \file
 *
 * \brief Component description for ADC
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-07-05T18:00:00Z */
#ifndef _SAMG53_ADC_COMPONENT_H_
#define _SAMG53_ADC_COMPONENT_H_
#define _SAMG53_ADC_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAMG_SAMG53 Analog-to-Digital Converter
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ADC */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define ADC_6489                       /**< (ADC) Module ID */
#define REV_ADC Z                      /**< (ADC) Module revision */

/* -------- ADC_CR : (ADC Offset: 0x00) (/W 32) Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SWRST:1;                   /**< bit:      0  Software Reset                           */
    uint32_t START:1;                   /**< bit:      1  Start Conversion                         */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t CMPRST:1;                  /**< bit:      4  Comparison Restart                       */
    uint32_t :27;                       /**< bit:  5..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_CR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_CR_OFFSET                       (0x00)                                        /**<  (ADC_CR) Control Register  Offset */

#define ADC_CR_SWRST_Pos                    0                                              /**< (ADC_CR) Software Reset Position */
#define ADC_CR_SWRST_Msk                    (_U_(0x1) << ADC_CR_SWRST_Pos)                 /**< (ADC_CR) Software Reset Mask */
#define ADC_CR_SWRST                        ADC_CR_SWRST_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CR_SWRST_Msk instead */
#define ADC_CR_START_Pos                    1                                              /**< (ADC_CR) Start Conversion Position */
#define ADC_CR_START_Msk                    (_U_(0x1) << ADC_CR_START_Pos)                 /**< (ADC_CR) Start Conversion Mask */
#define ADC_CR_START                        ADC_CR_START_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CR_START_Msk instead */
#define ADC_CR_CMPRST_Pos                   4                                              /**< (ADC_CR) Comparison Restart Position */
#define ADC_CR_CMPRST_Msk                   (_U_(0x1) << ADC_CR_CMPRST_Pos)                /**< (ADC_CR) Comparison Restart Mask */
#define ADC_CR_CMPRST                       ADC_CR_CMPRST_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CR_CMPRST_Msk instead */
#define ADC_CR_MASK                         _U_(0x13)                                      /**< \deprecated (ADC_CR) Register MASK  (Use ADC_CR_Msk instead)  */
#define ADC_CR_Msk                          _U_(0x13)                                      /**< (ADC_CR) Register Mask  */


/* -------- ADC_MR : (ADC Offset: 0x04) (R/W 32) Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TRGEN:1;                   /**< bit:      0  Trigger Enable                           */
    uint32_t TRGSEL:3;                  /**< bit:   1..3  Trigger Selection                        */
    uint32_t LOWRES:1;                  /**< bit:      4  Resolution                               */
    uint32_t SLEEP:1;                   /**< bit:      5  Sleep Mode                               */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t FREERUN:1;                 /**< bit:      7  Free Run Mode                            */
    uint32_t PRESCAL:8;                 /**< bit:  8..15  Prescaler Rate Selection                 */
    uint32_t STARTUP:4;                 /**< bit: 16..19  Start Up Time                            */
    uint32_t :2;                        /**< bit: 20..21  Reserved */
    uint32_t DIV1:1;                    /**< bit:     22  ADC Clock Prescaler Division forced to 1 */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t TRACKTIM:4;                /**< bit: 24..27  Tracking Time                            */
    uint32_t TRANSFER:2;                /**< bit: 28..29  Transfer Period                          */
    uint32_t DIV3:1;                    /**< bit:     30  ADC Clock Prescaler Division forced to 3 */
    uint32_t USEQ:1;                    /**< bit:     31  Use Sequence Enable                      */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_MR_Type;
