ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_MR_OFFSET                       (0x04)                                        /**<  (ADC_MR) Mode Register  Offset */

#define ADC_MR_TRGEN_Pos                    0                                              /**< (ADC_MR) Trigger Enable Position */
#define ADC_MR_TRGEN_Msk                    (_U_(0x1) << ADC_MR_TRGEN_Pos)                 /**< (ADC_MR) Trigger Enable Mask */
#define ADC_MR_TRGEN                        ADC_MR_TRGEN_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_MR_TRGEN_Msk instead */
#define   ADC_MR_TRGEN_DIS_Val              _U_(0x0)                                       /**< (ADC_MR) Hardware triggers are disabled. Starting a conversion is only possible by software.  */
#define   ADC_MR_TRGEN_EN_Val               _U_(0x1)                                       /**< (ADC_MR) Hardware trigger selected by TRGSEL field is enabled.  */
#define ADC_MR_TRGEN_DIS                    (ADC_MR_TRGEN_DIS_Val << ADC_MR_TRGEN_Pos)     /**< (ADC_MR) Hardware triggers are disabled. Starting a conversion is only possible by software. Position  */
#define ADC_MR_TRGEN_EN                     (ADC_MR_TRGEN_EN_Val << ADC_MR_TRGEN_Pos)      /**< (ADC_MR) Hardware trigger selected by TRGSEL field is enabled. Position  */
#define ADC_MR_TRGSEL_Pos                   1                                              /**< (ADC_MR) Trigger Selection Position */
#define ADC_MR_TRGSEL_Msk                   (_U_(0x7) << ADC_MR_TRGSEL_Pos)                /**< (ADC_MR) Trigger Selection Mask */
#define ADC_MR_TRGSEL(value)                (ADC_MR_TRGSEL_Msk & ((value) << ADC_MR_TRGSEL_Pos))
#define   ADC_MR_TRGSEL_ADC_TRIG0_Val       _U_(0x0)                                       /**< (ADC_MR) External trigger  */
#define   ADC_MR_TRGSEL_ADC_TRIG1_Val       _U_(0x1)                                       /**< (ADC_MR) TIO Output of the Timer Counter Channel 0  */
#define   ADC_MR_TRGSEL_ADC_TRIG2_Val       _U_(0x2)                                       /**< (ADC_MR) TIO Output of the Timer Counter Channel 1  */
#define   ADC_MR_TRGSEL_ADC_TRIG3_Val       _U_(0x3)                                       /**< (ADC_MR) TIO Output of the Timer Counter Channel 2  */
#define   ADC_MR_TRGSEL_ADC_TRIG4_Val       _U_(0x4)                                       /**< (ADC_MR) RTCOUT0  */
#define   ADC_MR_TRGSEL_ADC_TRIG5_Val       _U_(0x5)                                       /**< (ADC_MR) RTTINC  */
#define ADC_MR_TRGSEL_ADC_TRIG0             (ADC_MR_TRGSEL_ADC_TRIG0_Val << ADC_MR_TRGSEL_Pos)  /**< (ADC_MR) External trigger Position  */
#define ADC_MR_TRGSEL_ADC_TRIG1             (ADC_MR_TRGSEL_ADC_TRIG1_Val << ADC_MR_TRGSEL_Pos)  /**< (ADC_MR) TIO Output of the Timer Counter Channel 0 Position  */
#define ADC_MR_TRGSEL_ADC_TRIG2             (ADC_MR_TRGSEL_ADC_TRIG2_Val << ADC_MR_TRGSEL_Pos)  /**< (ADC_MR) TIO Output of the Timer Counter Channel 1 Position  */
#define ADC_MR_TRGSEL_ADC_TRIG3             (ADC_MR_TRGSEL_ADC_TRIG3_Val << ADC_MR_TRGSEL_Pos)  /**< (ADC_MR) TIO Output of the Timer Counter Channel 2 Position  */
#define ADC_MR_TRGSEL_ADC_TRIG4             (ADC_MR_TRGSEL_ADC_TRIG4_Val << ADC_MR_TRGSEL_Pos)  /**< (ADC_MR) RTCOUT0 Position  */
#define ADC_MR_TRGSEL_ADC_TRIG5             (ADC_MR_TRGSEL_ADC_TRIG5_Val << ADC_MR_TRGSEL_Pos)  /**< (ADC_MR) RTTINC Position  */
#define ADC_MR_LOWRES_Pos                   4                                              /**< (ADC_MR) Resolution Position */
#define ADC_MR_LOWRES_Msk                   (_U_(0x1) << ADC_MR_LOWRES_Pos)                /**< (ADC_MR) Resolution Mask */
#define ADC_MR_LOWRES                       ADC_MR_LOWRES_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_MR_LOWRES_Msk instead */
#define   ADC_MR_LOWRES_BITS_10_Val         _U_(0x0)                                       /**< (ADC_MR) 10-bit resolution. For higher resolution by averaging, please refer to "ADC Extended Mode Register" on page 77.  */
#define   ADC_MR_LOWRES_BITS_8_Val          _U_(0x1)                                       /**< (ADC_MR) 8-bit resolution  */
#define ADC_MR_LOWRES_BITS_10               (ADC_MR_LOWRES_BITS_10_Val << ADC_MR_LOWRES_Pos)  /**< (ADC_MR) 10-bit resolution. For higher resolution by averaging, please refer to "ADC Extended Mode Register" on page 77. Position  */
#define ADC_MR_LOWRES_BITS_8                (ADC_MR_LOWRES_BITS_8_Val << ADC_MR_LOWRES_Pos)  /**< (ADC_MR) 8-bit resolution Position  */
#define ADC_MR_SLEEP_Pos                    5                                              /**< (ADC_MR) Sleep Mode Position */
#define ADC_MR_SLEEP_Msk                    (_U_(0x1) << ADC_MR_SLEEP_Pos)                 /**< (ADC_MR) Sleep Mode Mask */
#define ADC_MR_SLEEP                        ADC_MR_SLEEP_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_MR_SLEEP_Msk instead */
#define   ADC_MR_SLEEP_NORMAL_Val           _U_(0x0)                                       /**< (ADC_MR) Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions.  */
#define   ADC_MR_SLEEP_SLEEP_Val            _U_(0x1)                                       /**< (ADC_MR) Sleep Mode: The ADC core and reference voltage circuitry are OFF between conversions.  */
#define ADC_MR_SLEEP_NORMAL                 (ADC_MR_SLEEP_NORMAL_Val << ADC_MR_SLEEP_Pos)  /**< (ADC_MR) Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions. Position  */
#define ADC_MR_SLEEP_SLEEP                  (ADC_MR_SLEEP_SLEEP_Val << ADC_MR_SLEEP_Pos)   /**< (ADC_MR) Sleep Mode: The ADC core and reference voltage circuitry are OFF between conversions. Position  */
#define ADC_MR_FREERUN_Pos                  7                                              /**< (ADC_MR) Free Run Mode Position */
#define ADC_MR_FREERUN_Msk                  (_U_(0x1) << ADC_MR_FREERUN_Pos)               /**< (ADC_MR) Free Run Mode Mask */
#define ADC_MR_FREERUN                      ADC_MR_FREERUN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_MR_FREERUN_Msk instead */
#define   ADC_MR_FREERUN_OFF_Val            _U_(0x0)                                       /**< (ADC_MR) Normal Mode  */
#define   ADC_MR_FREERUN_ON_Val             _U_(0x1)                                       /**< (ADC_MR) Free Run Mode: Never wait for any trigger.  */
#define ADC_MR_FREERUN_OFF                  (ADC_MR_FREERUN_OFF_Val << ADC_MR_FREERUN_Pos)  /**< (ADC_MR) Normal Mode Position  */
#define ADC_MR_FREERUN_ON                   (ADC_MR_FREERUN_ON_Val << ADC_MR_FREERUN_Pos)  /**< (ADC_MR) Free Run Mode: Never wait for any trigger. Position  */
#define ADC_MR_PRESCAL_Pos                  8                                              /**< (ADC_MR) Prescaler Rate Selection Position */
#define ADC_MR_PRESCAL_Msk                  (_U_(0xFF) << ADC_MR_PRESCAL_Pos)              /**< (ADC_MR) Prescaler Rate Selection Mask */
#define ADC_MR_PRESCAL(value)               (ADC_MR_PRESCAL_Msk & ((value) << ADC_MR_PRESCAL_Pos))
#define ADC_MR_STARTUP_Pos                  16                                             /**< (ADC_MR) Start Up Time Position */
#define ADC_MR_STARTUP_Msk                  (_U_(0xF) << ADC_MR_STARTUP_Pos)               /**< (ADC_MR) Start Up Time Mask */
#define ADC_MR_STARTUP(value)               (ADC_MR_STARTUP_Msk & ((value) << ADC_MR_STARTUP_Pos))
#define   ADC_MR_STARTUP_SUT0_Val           _U_(0x0)                                       /**< (ADC_MR) 0 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT8_Val           _U_(0x1)                                       /**< (ADC_MR) 8 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT16_Val          _U_(0x2)                                       /**< (ADC_MR) 16 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT24_Val          _U_(0x3)                                       /**< (ADC_MR) 24 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT64_Val          _U_(0x4)                                       /**< (ADC_MR) 64 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT80_Val          _U_(0x5)                                       /**< (ADC_MR) 80 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT96_Val          _U_(0x6)                                       /**< (ADC_MR) 96 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT112_Val         _U_(0x7)                                       /**< (ADC_MR) 112 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT512_Val         _U_(0x8)                                       /**< (ADC_MR) 512 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT576_Val         _U_(0x9)                                       /**< (ADC_MR) 576 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT640_Val         _U_(0xA)                                       /**< (ADC_MR) 640 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT704_Val         _U_(0xB)                                       /**< (ADC_MR) 704 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT768_Val         _U_(0xC)                                       /**< (ADC_MR) 768 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT832_Val         _U_(0xD)                                       /**< (ADC_MR) 832 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT896_Val         _U_(0xE)                                       /**< (ADC_MR) 896 periods of ADCCLK  */
#define   ADC_MR_STARTUP_SUT960_Val         _U_(0xF)                                       /**< (ADC_MR) 960 periods of ADCCLK  */
#define ADC_MR_STARTUP_SUT0                 (ADC_MR_STARTUP_SUT0_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 0 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT8                 (ADC_MR_STARTUP_SUT8_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 8 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT16                (ADC_MR_STARTUP_SUT16_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 16 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT24                (ADC_MR_STARTUP_SUT24_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 24 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT64                (ADC_MR_STARTUP_SUT64_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 64 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT80                (ADC_MR_STARTUP_SUT80_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 80 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT96                (ADC_MR_STARTUP_SUT96_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 96 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT112               (ADC_MR_STARTUP_SUT112_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 112 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT512               (ADC_MR_STARTUP_SUT512_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 512 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT576               (ADC_MR_STARTUP_SUT576_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 576 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT640               (ADC_MR_STARTUP_SUT640_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 640 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT704               (ADC_MR_STARTUP_SUT704_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 704 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT768               (ADC_MR_STARTUP_SUT768_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 768 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT832               (ADC_MR_STARTUP_SUT832_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 832 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT896               (ADC_MR_STARTUP_SUT896_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 896 periods of ADCCLK Position  */
#define ADC_MR_STARTUP_SUT960               (ADC_MR_STARTUP_SUT960_Val << ADC_MR_STARTUP_Pos)  /**< (ADC_MR) 960 periods of ADCCLK Position  */
#define ADC_MR_DIV1_Pos                     22                                             /**< (ADC_MR) ADC Clock Prescaler Division forced to 1 Position */
#define ADC_MR_DIV1_Msk                     (_U_(0x1) << ADC_MR_DIV1_Pos)                  /**< (ADC_MR) ADC Clock Prescaler Division forced to 1 Mask */
#define ADC_MR_DIV1                         ADC_MR_DIV1_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_MR_DIV1_Msk instead */
#define   ADC_MR_DIV1_NO_DIV1_Val           _U_(0x0)                                       /**< (ADC_MR) The PRESCAL field is used to generate the ADC clock unless DIV3 is written to 1.  */
#define   ADC_MR_DIV1_FORCE_DIV1_Val        _U_(0x1)                                       /**< (ADC_MR) The ADC clock equals peripheral clock (PRESCAL and DIV3 fields have no effect).  */
#define ADC_MR_DIV1_NO_DIV1                 (ADC_MR_DIV1_NO_DIV1_Val << ADC_MR_DIV1_Pos)   /**< (ADC_MR) The PRESCAL field is used to generate the ADC clock unless DIV3 is written to 1. Position  */
#define ADC_MR_DIV1_FORCE_DIV1              (ADC_MR_DIV1_FORCE_DIV1_Val << ADC_MR_DIV1_Pos)  /**< (ADC_MR) The ADC clock equals peripheral clock (PRESCAL and DIV3 fields have no effect). Position  */
#define ADC_MR_TRACKTIM_Pos                 24                                             /**< (ADC_MR) Tracking Time Position */
#define ADC_MR_TRACKTIM_Msk                 (_U_(0xF) << ADC_MR_TRACKTIM_Pos)              /**< (ADC_MR) Tracking Time Mask */
#define ADC_MR_TRACKTIM(value)              (ADC_MR_TRACKTIM_Msk & ((value) << ADC_MR_TRACKTIM_Pos))
#define ADC_MR_TRANSFER_Pos                 28                                             /**< (ADC_MR) Transfer Period Position */
#define ADC_MR_TRANSFER_Msk                 (_U_(0x3) << ADC_MR_TRANSFER_Pos)              /**< (ADC_MR) Transfer Period Mask */
#define ADC_MR_TRANSFER(value)              (ADC_MR_TRANSFER_Msk & ((value) << ADC_MR_TRANSFER_Pos))
#define ADC_MR_DIV3_Pos                     30                                             /**< (ADC_MR) ADC Clock Prescaler Division forced to 3 Position */
#define ADC_MR_DIV3_Msk                     (_U_(0x1) << ADC_MR_DIV3_Pos)                  /**< (ADC_MR) ADC Clock Prescaler Division forced to 3 Mask */
#define ADC_MR_DIV3                         ADC_MR_DIV3_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_MR_DIV3_Msk instead */
#define   ADC_MR_DIV3_NO_DIV3_Val           _U_(0x0)                                       /**< (ADC_MR) The PRESCAL field is used to generate the ADC clock unless DIV1 is written to 1.  */
#define   ADC_MR_DIV3_FORCE_DIV3_Val        _U_(0x1)                                       /**< (ADC_MR) The ADC clock equals peripheral clock/3 unless DIV1 is written to 1.  */
#define ADC_MR_DIV3_NO_DIV3                 (ADC_MR_DIV3_NO_DIV3_Val << ADC_MR_DIV3_Pos)   /**< (ADC_MR) The PRESCAL field is used to generate the ADC clock unless DIV1 is written to 1. Position  */
#define ADC_MR_DIV3_FORCE_DIV3              (ADC_MR_DIV3_FORCE_DIV3_Val << ADC_MR_DIV3_Pos)  /**< (ADC_MR) The ADC clock equals peripheral clock/3 unless DIV1 is written to 1. Position  */
#define ADC_MR_USEQ_Pos                     31                                             /**< (ADC_MR) Use Sequence Enable Position */
#define ADC_MR_USEQ_Msk                     (_U_(0x1) << ADC_MR_USEQ_Pos)                  /**< (ADC_MR) Use Sequence Enable Mask */
#define ADC_MR_USEQ                         ADC_MR_USEQ_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_MR_USEQ_Msk instead */
#define   ADC_MR_USEQ_NUM_ORDER_Val         _U_(0x0)                                       /**< (ADC_MR) Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index.  */
#define   ADC_MR_USEQ_REG_ORDER_Val         _U_(0x1)                                       /**< (ADC_MR) User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 register and can be used to convert the same channel several times.  */
#define ADC_MR_USEQ_NUM_ORDER               (ADC_MR_USEQ_NUM_ORDER_Val << ADC_MR_USEQ_Pos)  /**< (ADC_MR) Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index. Position  */
#define ADC_MR_USEQ_REG_ORDER               (ADC_MR_USEQ_REG_ORDER_Val << ADC_MR_USEQ_Pos)  /**< (ADC_MR) User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 register and can be used to convert the same channel several times. Position  */
#define ADC_MR_MASK                         _U_(0xFF4FFFBF)                                /**< \deprecated (ADC_MR) Register MASK  (Use ADC_MR_Msk instead)  */
#define ADC_MR_Msk                          _U_(0xFF4FFFBF)                                /**< (ADC_MR) Register Mask  */


/* -------- ADC_SEQR1 : (ADC Offset: 0x08) (R/W 32) Channel Sequence Register 1 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t USCH1:4;                   /**< bit:   0..3  User Sequence Number 1                   */
    uint32_t USCH2:4;                   /**< bit:   4..7  User Sequence Number 2                   */
    uint32_t USCH3:4;                   /**< bit:  8..11  User Sequence Number 3                   */
    uint32_t USCH4:4;                   /**< bit: 12..15  User Sequence Number 4                   */
    uint32_t USCH5:4;                   /**< bit: 16..19  User Sequence Number 5                   */
    uint32_t USCH6:4;                   /**< bit: 20..23  User Sequence Number 6                   */
    uint32_t USCH7:4;                   /**< bit: 24..27  User Sequence Number 7                   */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_SEQR1_Type;
