ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_SEQR1_OFFSET                    (0x08)                                        /**<  (ADC_SEQR1) Channel Sequence Register 1  Offset */

#define ADC_SEQR1_USCH1_Pos                 0                                              /**< (ADC_SEQR1) User Sequence Number 1 Position */
#define ADC_SEQR1_USCH1_Msk                 (_U_(0xF) << ADC_SEQR1_USCH1_Pos)              /**< (ADC_SEQR1) User Sequence Number 1 Mask */
#define ADC_SEQR1_USCH1(value)              (ADC_SEQR1_USCH1_Msk & ((value) << ADC_SEQR1_USCH1_Pos))
#define ADC_SEQR1_USCH2_Pos                 4                                              /**< (ADC_SEQR1) User Sequence Number 2 Position */
#define ADC_SEQR1_USCH2_Msk                 (_U_(0xF) << ADC_SEQR1_USCH2_Pos)              /**< (ADC_SEQR1) User Sequence Number 2 Mask */
#define ADC_SEQR1_USCH2(value)              (ADC_SEQR1_USCH2_Msk & ((value) << ADC_SEQR1_USCH2_Pos))
#define ADC_SEQR1_USCH3_Pos                 8                                              /**< (ADC_SEQR1) User Sequence Number 3 Position */
#define ADC_SEQR1_USCH3_Msk                 (_U_(0xF) << ADC_SEQR1_USCH3_Pos)              /**< (ADC_SEQR1) User Sequence Number 3 Mask */
#define ADC_SEQR1_USCH3(value)              (ADC_SEQR1_USCH3_Msk & ((value) << ADC_SEQR1_USCH3_Pos))
#define ADC_SEQR1_USCH4_Pos                 12                                             /**< (ADC_SEQR1) User Sequence Number 4 Position */
#define ADC_SEQR1_USCH4_Msk                 (_U_(0xF) << ADC_SEQR1_USCH4_Pos)              /**< (ADC_SEQR1) User Sequence Number 4 Mask */
#define ADC_SEQR1_USCH4(value)              (ADC_SEQR1_USCH4_Msk & ((value) << ADC_SEQR1_USCH4_Pos))
#define ADC_SEQR1_USCH5_Pos                 16                                             /**< (ADC_SEQR1) User Sequence Number 5 Position */
#define ADC_SEQR1_USCH5_Msk                 (_U_(0xF) << ADC_SEQR1_USCH5_Pos)              /**< (ADC_SEQR1) User Sequence Number 5 Mask */
#define ADC_SEQR1_USCH5(value)              (ADC_SEQR1_USCH5_Msk & ((value) << ADC_SEQR1_USCH5_Pos))
#define ADC_SEQR1_USCH6_Pos                 20                                             /**< (ADC_SEQR1) User Sequence Number 6 Position */
#define ADC_SEQR1_USCH6_Msk                 (_U_(0xF) << ADC_SEQR1_USCH6_Pos)              /**< (ADC_SEQR1) User Sequence Number 6 Mask */
#define ADC_SEQR1_USCH6(value)              (ADC_SEQR1_USCH6_Msk & ((value) << ADC_SEQR1_USCH6_Pos))
#define ADC_SEQR1_USCH7_Pos                 24                                             /**< (ADC_SEQR1) User Sequence Number 7 Position */
#define ADC_SEQR1_USCH7_Msk                 (_U_(0xF) << ADC_SEQR1_USCH7_Pos)              /**< (ADC_SEQR1) User Sequence Number 7 Mask */
#define ADC_SEQR1_USCH7(value)              (ADC_SEQR1_USCH7_Msk & ((value) << ADC_SEQR1_USCH7_Pos))
#define ADC_SEQR1_MASK                      _U_(0xFFFFFFF)                                 /**< \deprecated (ADC_SEQR1) Register MASK  (Use ADC_SEQR1_Msk instead)  */
#define ADC_SEQR1_Msk                       _U_(0xFFFFFFF)                                 /**< (ADC_SEQR1) Register Mask  */


/* -------- ADC_CHER : (ADC Offset: 0x10) (/W 32) Channel Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Enable                         */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Enable                         */
    uint32_t CH2:1;                     /**< bit:      2  Channel 2 Enable                         */
    uint32_t CH3:1;                     /**< bit:      3  Channel 3 Enable                         */
    uint32_t CH4:1;                     /**< bit:      4  Channel 4 Enable                         */
    uint32_t CH5:1;                     /**< bit:      5  Channel 5 Enable                         */
    uint32_t CH6:1;                     /**< bit:      6  Channel 6 Enable                         */
    uint32_t CH7:1;                     /**< bit:      7  Channel 7 Enable                         */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CH:8;                      /**< bit:   0..7  Channel 7 Enable                         */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} ADC_CHER_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_CHER_OFFSET                     (0x10)                                        /**<  (ADC_CHER) Channel Enable Register  Offset */

#define ADC_CHER_CH0_Pos                    0                                              /**< (ADC_CHER) Channel 0 Enable Position */
#define ADC_CHER_CH0_Msk                    (_U_(0x1) << ADC_CHER_CH0_Pos)                 /**< (ADC_CHER) Channel 0 Enable Mask */
#define ADC_CHER_CH0                        ADC_CHER_CH0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHER_CH0_Msk instead */
#define ADC_CHER_CH1_Pos                    1                                              /**< (ADC_CHER) Channel 1 Enable Position */
#define ADC_CHER_CH1_Msk                    (_U_(0x1) << ADC_CHER_CH1_Pos)                 /**< (ADC_CHER) Channel 1 Enable Mask */
#define ADC_CHER_CH1                        ADC_CHER_CH1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHER_CH1_Msk instead */
#define ADC_CHER_CH2_Pos                    2                                              /**< (ADC_CHER) Channel 2 Enable Position */
#define ADC_CHER_CH2_Msk                    (_U_(0x1) << ADC_CHER_CH2_Pos)                 /**< (ADC_CHER) Channel 2 Enable Mask */
#define ADC_CHER_CH2                        ADC_CHER_CH2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHER_CH2_Msk instead */
#define ADC_CHER_CH3_Pos                    3                                              /**< (ADC_CHER) Channel 3 Enable Position */
#define ADC_CHER_CH3_Msk                    (_U_(0x1) << ADC_CHER_CH3_Pos)                 /**< (ADC_CHER) Channel 3 Enable Mask */
#define ADC_CHER_CH3                        ADC_CHER_CH3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHER_CH3_Msk instead */
#define ADC_CHER_CH4_Pos                    4                                              /**< (ADC_CHER) Channel 4 Enable Position */
#define ADC_CHER_CH4_Msk                    (_U_(0x1) << ADC_CHER_CH4_Pos)                 /**< (ADC_CHER) Channel 4 Enable Mask */
#define ADC_CHER_CH4                        ADC_CHER_CH4_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHER_CH4_Msk instead */
#define ADC_CHER_CH5_Pos                    5                                              /**< (ADC_CHER) Channel 5 Enable Position */
#define ADC_CHER_CH5_Msk                    (_U_(0x1) << ADC_CHER_CH5_Pos)                 /**< (ADC_CHER) Channel 5 Enable Mask */
#define ADC_CHER_CH5                        ADC_CHER_CH5_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHER_CH5_Msk instead */
#define ADC_CHER_CH6_Pos                    6                                              /**< (ADC_CHER) Channel 6 Enable Position */
#define ADC_CHER_CH6_Msk                    (_U_(0x1) << ADC_CHER_CH6_Pos)                 /**< (ADC_CHER) Channel 6 Enable Mask */
#define ADC_CHER_CH6                        ADC_CHER_CH6_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHER_CH6_Msk instead */
#define ADC_CHER_CH7_Pos                    7                                              /**< (ADC_CHER) Channel 7 Enable Position */
#define ADC_CHER_CH7_Msk                    (_U_(0x1) << ADC_CHER_CH7_Pos)                 /**< (ADC_CHER) Channel 7 Enable Mask */
#define ADC_CHER_CH7                        ADC_CHER_CH7_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHER_CH7_Msk instead */
#define ADC_CHER_MASK                       _U_(0xFF)                                      /**< \deprecated (ADC_CHER) Register MASK  (Use ADC_CHER_Msk instead)  */
#define ADC_CHER_Msk                        _U_(0xFF)                                      /**< (ADC_CHER) Register Mask  */

#define ADC_CHER_CH_Pos                     0                                              /**< (ADC_CHER Position) Channel 7 Enable */
#define ADC_CHER_CH_Msk                     (_U_(0xFF) << ADC_CHER_CH_Pos)                 /**< (ADC_CHER Mask) CH */
#define ADC_CHER_CH(value)                  (ADC_CHER_CH_Msk & ((value) << ADC_CHER_CH_Pos))  

