ataradov/mcu-starter-projects/samg53/include/component/adc.h
/* -------- ADC_CHDR : (ADC Offset: 0x14) (/W 32) Channel Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Disable                        */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Disable                        */
    uint32_t CH2:1;                     /**< bit:      2  Channel 2 Disable                        */
    uint32_t CH3:1;                     /**< bit:      3  Channel 3 Disable                        */
    uint32_t CH4:1;                     /**< bit:      4  Channel 4 Disable                        */
    uint32_t CH5:1;                     /**< bit:      5  Channel 5 Disable                        */
    uint32_t CH6:1;                     /**< bit:      6  Channel 6 Disable                        */
    uint32_t CH7:1;                     /**< bit:      7  Channel 7 Disable                        */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CH:8;                      /**< bit:   0..7  Channel 7 Disable                        */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} ADC_CHDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_CHDR_OFFSET                     (0x14)                                        /**<  (ADC_CHDR) Channel Disable Register  Offset */

#define ADC_CHDR_CH0_Pos                    0                                              /**< (ADC_CHDR) Channel 0 Disable Position */
#define ADC_CHDR_CH0_Msk                    (_U_(0x1) << ADC_CHDR_CH0_Pos)                 /**< (ADC_CHDR) Channel 0 Disable Mask */
#define ADC_CHDR_CH0                        ADC_CHDR_CH0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHDR_CH0_Msk instead */
#define ADC_CHDR_CH1_Pos                    1                                              /**< (ADC_CHDR) Channel 1 Disable Position */
#define ADC_CHDR_CH1_Msk                    (_U_(0x1) << ADC_CHDR_CH1_Pos)                 /**< (ADC_CHDR) Channel 1 Disable Mask */
#define ADC_CHDR_CH1                        ADC_CHDR_CH1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHDR_CH1_Msk instead */
#define ADC_CHDR_CH2_Pos                    2                                              /**< (ADC_CHDR) Channel 2 Disable Position */
#define ADC_CHDR_CH2_Msk                    (_U_(0x1) << ADC_CHDR_CH2_Pos)                 /**< (ADC_CHDR) Channel 2 Disable Mask */
#define ADC_CHDR_CH2                        ADC_CHDR_CH2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHDR_CH2_Msk instead */
#define ADC_CHDR_CH3_Pos                    3                                              /**< (ADC_CHDR) Channel 3 Disable Position */
#define ADC_CHDR_CH3_Msk                    (_U_(0x1) << ADC_CHDR_CH3_Pos)                 /**< (ADC_CHDR) Channel 3 Disable Mask */
#define ADC_CHDR_CH3                        ADC_CHDR_CH3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHDR_CH3_Msk instead */
#define ADC_CHDR_CH4_Pos                    4                                              /**< (ADC_CHDR) Channel 4 Disable Position */
#define ADC_CHDR_CH4_Msk                    (_U_(0x1) << ADC_CHDR_CH4_Pos)                 /**< (ADC_CHDR) Channel 4 Disable Mask */
#define ADC_CHDR_CH4                        ADC_CHDR_CH4_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHDR_CH4_Msk instead */
#define ADC_CHDR_CH5_Pos                    5                                              /**< (ADC_CHDR) Channel 5 Disable Position */
#define ADC_CHDR_CH5_Msk                    (_U_(0x1) << ADC_CHDR_CH5_Pos)                 /**< (ADC_CHDR) Channel 5 Disable Mask */
#define ADC_CHDR_CH5                        ADC_CHDR_CH5_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHDR_CH5_Msk instead */
#define ADC_CHDR_CH6_Pos                    6                                              /**< (ADC_CHDR) Channel 6 Disable Position */
#define ADC_CHDR_CH6_Msk                    (_U_(0x1) << ADC_CHDR_CH6_Pos)                 /**< (ADC_CHDR) Channel 6 Disable Mask */
#define ADC_CHDR_CH6                        ADC_CHDR_CH6_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHDR_CH6_Msk instead */
#define ADC_CHDR_CH7_Pos                    7                                              /**< (ADC_CHDR) Channel 7 Disable Position */
#define ADC_CHDR_CH7_Msk                    (_U_(0x1) << ADC_CHDR_CH7_Pos)                 /**< (ADC_CHDR) Channel 7 Disable Mask */
#define ADC_CHDR_CH7                        ADC_CHDR_CH7_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHDR_CH7_Msk instead */
#define ADC_CHDR_MASK                       _U_(0xFF)                                      /**< \deprecated (ADC_CHDR) Register MASK  (Use ADC_CHDR_Msk instead)  */
#define ADC_CHDR_Msk                        _U_(0xFF)                                      /**< (ADC_CHDR) Register Mask  */

#define ADC_CHDR_CH_Pos                     0                                              /**< (ADC_CHDR Position) Channel 7 Disable */
#define ADC_CHDR_CH_Msk                     (_U_(0xFF) << ADC_CHDR_CH_Pos)                 /**< (ADC_CHDR Mask) CH */
#define ADC_CHDR_CH(value)                  (ADC_CHDR_CH_Msk & ((value) << ADC_CHDR_CH_Pos))  

/* -------- ADC_CHSR : (ADC Offset: 0x18) (R/ 32) Channel Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Status                         */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Status                         */
    uint32_t CH2:1;                     /**< bit:      2  Channel 2 Status                         */
    uint32_t CH3:1;                     /**< bit:      3  Channel 3 Status                         */
    uint32_t CH4:1;                     /**< bit:      4  Channel 4 Status                         */
    uint32_t CH5:1;                     /**< bit:      5  Channel 5 Status                         */
    uint32_t CH6:1;                     /**< bit:      6  Channel 6 Status                         */
    uint32_t CH7:1;                     /**< bit:      7  Channel 7 Status                         */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CH:8;                      /**< bit:   0..7  Channel 7 Status                         */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} ADC_CHSR_Type;
