ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_CHSR_OFFSET                     (0x18)                                        /**<  (ADC_CHSR) Channel Status Register  Offset */

#define ADC_CHSR_CH0_Pos                    0                                              /**< (ADC_CHSR) Channel 0 Status Position */
#define ADC_CHSR_CH0_Msk                    (_U_(0x1) << ADC_CHSR_CH0_Pos)                 /**< (ADC_CHSR) Channel 0 Status Mask */
#define ADC_CHSR_CH0                        ADC_CHSR_CH0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHSR_CH0_Msk instead */
#define ADC_CHSR_CH1_Pos                    1                                              /**< (ADC_CHSR) Channel 1 Status Position */
#define ADC_CHSR_CH1_Msk                    (_U_(0x1) << ADC_CHSR_CH1_Pos)                 /**< (ADC_CHSR) Channel 1 Status Mask */
#define ADC_CHSR_CH1                        ADC_CHSR_CH1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHSR_CH1_Msk instead */
#define ADC_CHSR_CH2_Pos                    2                                              /**< (ADC_CHSR) Channel 2 Status Position */
#define ADC_CHSR_CH2_Msk                    (_U_(0x1) << ADC_CHSR_CH2_Pos)                 /**< (ADC_CHSR) Channel 2 Status Mask */
#define ADC_CHSR_CH2                        ADC_CHSR_CH2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHSR_CH2_Msk instead */
#define ADC_CHSR_CH3_Pos                    3                                              /**< (ADC_CHSR) Channel 3 Status Position */
#define ADC_CHSR_CH3_Msk                    (_U_(0x1) << ADC_CHSR_CH3_Pos)                 /**< (ADC_CHSR) Channel 3 Status Mask */
#define ADC_CHSR_CH3                        ADC_CHSR_CH3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHSR_CH3_Msk instead */
#define ADC_CHSR_CH4_Pos                    4                                              /**< (ADC_CHSR) Channel 4 Status Position */
#define ADC_CHSR_CH4_Msk                    (_U_(0x1) << ADC_CHSR_CH4_Pos)                 /**< (ADC_CHSR) Channel 4 Status Mask */
#define ADC_CHSR_CH4                        ADC_CHSR_CH4_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHSR_CH4_Msk instead */
#define ADC_CHSR_CH5_Pos                    5                                              /**< (ADC_CHSR) Channel 5 Status Position */
#define ADC_CHSR_CH5_Msk                    (_U_(0x1) << ADC_CHSR_CH5_Pos)                 /**< (ADC_CHSR) Channel 5 Status Mask */
#define ADC_CHSR_CH5                        ADC_CHSR_CH5_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHSR_CH5_Msk instead */
#define ADC_CHSR_CH6_Pos                    6                                              /**< (ADC_CHSR) Channel 6 Status Position */
#define ADC_CHSR_CH6_Msk                    (_U_(0x1) << ADC_CHSR_CH6_Pos)                 /**< (ADC_CHSR) Channel 6 Status Mask */
#define ADC_CHSR_CH6                        ADC_CHSR_CH6_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHSR_CH6_Msk instead */
#define ADC_CHSR_CH7_Pos                    7                                              /**< (ADC_CHSR) Channel 7 Status Position */
#define ADC_CHSR_CH7_Msk                    (_U_(0x1) << ADC_CHSR_CH7_Pos)                 /**< (ADC_CHSR) Channel 7 Status Mask */
#define ADC_CHSR_CH7                        ADC_CHSR_CH7_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_CHSR_CH7_Msk instead */
#define ADC_CHSR_MASK                       _U_(0xFF)                                      /**< \deprecated (ADC_CHSR) Register MASK  (Use ADC_CHSR_Msk instead)  */
#define ADC_CHSR_Msk                        _U_(0xFF)                                      /**< (ADC_CHSR) Register Mask  */

#define ADC_CHSR_CH_Pos                     0                                              /**< (ADC_CHSR Position) Channel 7 Status */
#define ADC_CHSR_CH_Msk                     (_U_(0xFF) << ADC_CHSR_CH_Pos)                 /**< (ADC_CHSR Mask) CH */
#define ADC_CHSR_CH(value)                  (ADC_CHSR_CH_Msk & ((value) << ADC_CHSR_CH_Pos))  

/* -------- ADC_LCDR : (ADC Offset: 0x20) (R/ 32) Last Converted Data Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LDATA:12;                  /**< bit:  0..11  Last Data Converted                      */
    uint32_t CHNB:4;                    /**< bit: 12..15  Channel Number                           */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_LCDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_LCDR_OFFSET                     (0x20)                                        /**<  (ADC_LCDR) Last Converted Data Register  Offset */

#define ADC_LCDR_LDATA_Pos                  0                                              /**< (ADC_LCDR) Last Data Converted Position */
#define ADC_LCDR_LDATA_Msk                  (_U_(0xFFF) << ADC_LCDR_LDATA_Pos)             /**< (ADC_LCDR) Last Data Converted Mask */
#define ADC_LCDR_LDATA(value)               (ADC_LCDR_LDATA_Msk & ((value) << ADC_LCDR_LDATA_Pos))
#define ADC_LCDR_CHNB_Pos                   12                                             /**< (ADC_LCDR) Channel Number Position */
#define ADC_LCDR_CHNB_Msk                   (_U_(0xF) << ADC_LCDR_CHNB_Pos)                /**< (ADC_LCDR) Channel Number Mask */
#define ADC_LCDR_CHNB(value)                (ADC_LCDR_CHNB_Msk & ((value) << ADC_LCDR_CHNB_Pos))
#define ADC_LCDR_MASK                       _U_(0xFFFF)                                    /**< \deprecated (ADC_LCDR) Register MASK  (Use ADC_LCDR_Msk instead)  */
#define ADC_LCDR_Msk                        _U_(0xFFFF)                                    /**< (ADC_LCDR) Register Mask  */


/* -------- ADC_IER : (ADC Offset: 0x24) (/W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion Interrupt Enable 0     */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion Interrupt Enable 1     */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion Interrupt Enable 2     */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion Interrupt Enable 3     */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion Interrupt Enable 4     */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion Interrupt Enable 5     */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion Interrupt Enable 6     */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion Interrupt Enable 7     */
    uint32_t :11;                       /**< bit:  8..18  Reserved */
    uint32_t LCCHG:1;                   /**< bit:     19  Last Channel Change Interrupt Enable     */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Enable              */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error Interrupt Enable   */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Event Interrupt Enable        */
    uint32_t ENDRX:1;                   /**< bit:     27  End of Receive Buffer Interrupt Enable   */
    uint32_t RXBUFF:1;                  /**< bit:     28  Receive Buffer Full Interrupt Enable     */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t EOC:8;                     /**< bit:   0..7  End of Conversion Interrupt Enable x     */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} ADC_IER_Type;
