ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_IER_OFFSET                      (0x24)                                        /**<  (ADC_IER) Interrupt Enable Register  Offset */

#define ADC_IER_EOC0_Pos                    0                                              /**< (ADC_IER) End of Conversion Interrupt Enable 0 Position */
#define ADC_IER_EOC0_Msk                    (_U_(0x1) << ADC_IER_EOC0_Pos)                 /**< (ADC_IER) End of Conversion Interrupt Enable 0 Mask */
#define ADC_IER_EOC0                        ADC_IER_EOC0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_EOC0_Msk instead */
#define ADC_IER_EOC1_Pos                    1                                              /**< (ADC_IER) End of Conversion Interrupt Enable 1 Position */
#define ADC_IER_EOC1_Msk                    (_U_(0x1) << ADC_IER_EOC1_Pos)                 /**< (ADC_IER) End of Conversion Interrupt Enable 1 Mask */
#define ADC_IER_EOC1                        ADC_IER_EOC1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_EOC1_Msk instead */
#define ADC_IER_EOC2_Pos                    2                                              /**< (ADC_IER) End of Conversion Interrupt Enable 2 Position */
#define ADC_IER_EOC2_Msk                    (_U_(0x1) << ADC_IER_EOC2_Pos)                 /**< (ADC_IER) End of Conversion Interrupt Enable 2 Mask */
#define ADC_IER_EOC2                        ADC_IER_EOC2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_EOC2_Msk instead */
#define ADC_IER_EOC3_Pos                    3                                              /**< (ADC_IER) End of Conversion Interrupt Enable 3 Position */
#define ADC_IER_EOC3_Msk                    (_U_(0x1) << ADC_IER_EOC3_Pos)                 /**< (ADC_IER) End of Conversion Interrupt Enable 3 Mask */
#define ADC_IER_EOC3                        ADC_IER_EOC3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_EOC3_Msk instead */
#define ADC_IER_EOC4_Pos                    4                                              /**< (ADC_IER) End of Conversion Interrupt Enable 4 Position */
#define ADC_IER_EOC4_Msk                    (_U_(0x1) << ADC_IER_EOC4_Pos)                 /**< (ADC_IER) End of Conversion Interrupt Enable 4 Mask */
#define ADC_IER_EOC4                        ADC_IER_EOC4_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_EOC4_Msk instead */
#define ADC_IER_EOC5_Pos                    5                                              /**< (ADC_IER) End of Conversion Interrupt Enable 5 Position */
#define ADC_IER_EOC5_Msk                    (_U_(0x1) << ADC_IER_EOC5_Pos)                 /**< (ADC_IER) End of Conversion Interrupt Enable 5 Mask */
#define ADC_IER_EOC5                        ADC_IER_EOC5_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_EOC5_Msk instead */
#define ADC_IER_EOC6_Pos                    6                                              /**< (ADC_IER) End of Conversion Interrupt Enable 6 Position */
#define ADC_IER_EOC6_Msk                    (_U_(0x1) << ADC_IER_EOC6_Pos)                 /**< (ADC_IER) End of Conversion Interrupt Enable 6 Mask */
#define ADC_IER_EOC6                        ADC_IER_EOC6_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_EOC6_Msk instead */
#define ADC_IER_EOC7_Pos                    7                                              /**< (ADC_IER) End of Conversion Interrupt Enable 7 Position */
#define ADC_IER_EOC7_Msk                    (_U_(0x1) << ADC_IER_EOC7_Pos)                 /**< (ADC_IER) End of Conversion Interrupt Enable 7 Mask */
#define ADC_IER_EOC7                        ADC_IER_EOC7_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_EOC7_Msk instead */
#define ADC_IER_LCCHG_Pos                   19                                             /**< (ADC_IER) Last Channel Change Interrupt Enable Position */
#define ADC_IER_LCCHG_Msk                   (_U_(0x1) << ADC_IER_LCCHG_Pos)                /**< (ADC_IER) Last Channel Change Interrupt Enable Mask */
#define ADC_IER_LCCHG                       ADC_IER_LCCHG_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_LCCHG_Msk instead */
#define ADC_IER_DRDY_Pos                    24                                             /**< (ADC_IER) Data Ready Interrupt Enable Position */
#define ADC_IER_DRDY_Msk                    (_U_(0x1) << ADC_IER_DRDY_Pos)                 /**< (ADC_IER) Data Ready Interrupt Enable Mask */
#define ADC_IER_DRDY                        ADC_IER_DRDY_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_DRDY_Msk instead */
#define ADC_IER_GOVRE_Pos                   25                                             /**< (ADC_IER) General Overrun Error Interrupt Enable Position */
#define ADC_IER_GOVRE_Msk                   (_U_(0x1) << ADC_IER_GOVRE_Pos)                /**< (ADC_IER) General Overrun Error Interrupt Enable Mask */
#define ADC_IER_GOVRE                       ADC_IER_GOVRE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_GOVRE_Msk instead */
#define ADC_IER_COMPE_Pos                   26                                             /**< (ADC_IER) Comparison Event Interrupt Enable Position */
#define ADC_IER_COMPE_Msk                   (_U_(0x1) << ADC_IER_COMPE_Pos)                /**< (ADC_IER) Comparison Event Interrupt Enable Mask */
#define ADC_IER_COMPE                       ADC_IER_COMPE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_COMPE_Msk instead */
#define ADC_IER_ENDRX_Pos                   27                                             /**< (ADC_IER) End of Receive Buffer Interrupt Enable Position */
#define ADC_IER_ENDRX_Msk                   (_U_(0x1) << ADC_IER_ENDRX_Pos)                /**< (ADC_IER) End of Receive Buffer Interrupt Enable Mask */
#define ADC_IER_ENDRX                       ADC_IER_ENDRX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_ENDRX_Msk instead */
#define ADC_IER_RXBUFF_Pos                  28                                             /**< (ADC_IER) Receive Buffer Full Interrupt Enable Position */
#define ADC_IER_RXBUFF_Msk                  (_U_(0x1) << ADC_IER_RXBUFF_Pos)               /**< (ADC_IER) Receive Buffer Full Interrupt Enable Mask */
#define ADC_IER_RXBUFF                      ADC_IER_RXBUFF_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IER_RXBUFF_Msk instead */
#define ADC_IER_MASK                        _U_(0x1F0800FF)                                /**< \deprecated (ADC_IER) Register MASK  (Use ADC_IER_Msk instead)  */
#define ADC_IER_Msk                         _U_(0x1F0800FF)                                /**< (ADC_IER) Register Mask  */

