ataradov/mcu-starter-projects/samg53/include/component/adc.h
#define ADC_IER_EOC_Pos                     0                                              /**< (ADC_IER Position) End of Conversion Interrupt Enable x */
#define ADC_IER_EOC_Msk                     (_U_(0xFF) << ADC_IER_EOC_Pos)                 /**< (ADC_IER Mask) EOC */
#define ADC_IER_EOC(value)                  (ADC_IER_EOC_Msk & ((value) << ADC_IER_EOC_Pos))  

/* -------- ADC_IDR : (ADC Offset: 0x28) (/W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion Interrupt Disable 0    */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion Interrupt Disable 1    */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion Interrupt Disable 2    */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion Interrupt Disable 3    */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion Interrupt Disable 4    */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion Interrupt Disable 5    */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion Interrupt Disable 6    */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion Interrupt Disable 7    */
    uint32_t :11;                       /**< bit:  8..18  Reserved */
    uint32_t LCCHG:1;                   /**< bit:     19  Last Channel Change Interrupt Disable    */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Disable             */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error Interrupt Disable  */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Event Interrupt Disable       */
    uint32_t ENDRX:1;                   /**< bit:     27  End of Receive Buffer Interrupt Disable  */
    uint32_t RXBUFF:1;                  /**< bit:     28  Receive Buffer Full Interrupt Disable    */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t EOC:8;                     /**< bit:   0..7  End of Conversion Interrupt Disable x    */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} ADC_IDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_IDR_OFFSET                      (0x28)                                        /**<  (ADC_IDR) Interrupt Disable Register  Offset */

#define ADC_IDR_EOC0_Pos                    0                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 0 Position */
#define ADC_IDR_EOC0_Msk                    (_U_(0x1) << ADC_IDR_EOC0_Pos)                 /**< (ADC_IDR) End of Conversion Interrupt Disable 0 Mask */
#define ADC_IDR_EOC0                        ADC_IDR_EOC0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_EOC0_Msk instead */
#define ADC_IDR_EOC1_Pos                    1                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 1 Position */
#define ADC_IDR_EOC1_Msk                    (_U_(0x1) << ADC_IDR_EOC1_Pos)                 /**< (ADC_IDR) End of Conversion Interrupt Disable 1 Mask */
#define ADC_IDR_EOC1                        ADC_IDR_EOC1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_EOC1_Msk instead */
#define ADC_IDR_EOC2_Pos                    2                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 2 Position */
#define ADC_IDR_EOC2_Msk                    (_U_(0x1) << ADC_IDR_EOC2_Pos)                 /**< (ADC_IDR) End of Conversion Interrupt Disable 2 Mask */
#define ADC_IDR_EOC2                        ADC_IDR_EOC2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_EOC2_Msk instead */
#define ADC_IDR_EOC3_Pos                    3                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 3 Position */
#define ADC_IDR_EOC3_Msk                    (_U_(0x1) << ADC_IDR_EOC3_Pos)                 /**< (ADC_IDR) End of Conversion Interrupt Disable 3 Mask */
#define ADC_IDR_EOC3                        ADC_IDR_EOC3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_EOC3_Msk instead */
#define ADC_IDR_EOC4_Pos                    4                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 4 Position */
#define ADC_IDR_EOC4_Msk                    (_U_(0x1) << ADC_IDR_EOC4_Pos)                 /**< (ADC_IDR) End of Conversion Interrupt Disable 4 Mask */
#define ADC_IDR_EOC4                        ADC_IDR_EOC4_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_EOC4_Msk instead */
#define ADC_IDR_EOC5_Pos                    5                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 5 Position */
#define ADC_IDR_EOC5_Msk                    (_U_(0x1) << ADC_IDR_EOC5_Pos)                 /**< (ADC_IDR) End of Conversion Interrupt Disable 5 Mask */
#define ADC_IDR_EOC5                        ADC_IDR_EOC5_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_EOC5_Msk instead */
#define ADC_IDR_EOC6_Pos                    6                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 6 Position */
#define ADC_IDR_EOC6_Msk                    (_U_(0x1) << ADC_IDR_EOC6_Pos)                 /**< (ADC_IDR) End of Conversion Interrupt Disable 6 Mask */
#define ADC_IDR_EOC6                        ADC_IDR_EOC6_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_EOC6_Msk instead */
#define ADC_IDR_EOC7_Pos                    7                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 7 Position */
#define ADC_IDR_EOC7_Msk                    (_U_(0x1) << ADC_IDR_EOC7_Pos)                 /**< (ADC_IDR) End of Conversion Interrupt Disable 7 Mask */
#define ADC_IDR_EOC7                        ADC_IDR_EOC7_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_EOC7_Msk instead */
#define ADC_IDR_LCCHG_Pos                   19                                             /**< (ADC_IDR) Last Channel Change Interrupt Disable Position */
#define ADC_IDR_LCCHG_Msk                   (_U_(0x1) << ADC_IDR_LCCHG_Pos)                /**< (ADC_IDR) Last Channel Change Interrupt Disable Mask */
#define ADC_IDR_LCCHG                       ADC_IDR_LCCHG_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_LCCHG_Msk instead */
#define ADC_IDR_DRDY_Pos                    24                                             /**< (ADC_IDR) Data Ready Interrupt Disable Position */
#define ADC_IDR_DRDY_Msk                    (_U_(0x1) << ADC_IDR_DRDY_Pos)                 /**< (ADC_IDR) Data Ready Interrupt Disable Mask */
#define ADC_IDR_DRDY                        ADC_IDR_DRDY_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_DRDY_Msk instead */
#define ADC_IDR_GOVRE_Pos                   25                                             /**< (ADC_IDR) General Overrun Error Interrupt Disable Position */
#define ADC_IDR_GOVRE_Msk                   (_U_(0x1) << ADC_IDR_GOVRE_Pos)                /**< (ADC_IDR) General Overrun Error Interrupt Disable Mask */
#define ADC_IDR_GOVRE                       ADC_IDR_GOVRE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_GOVRE_Msk instead */
#define ADC_IDR_COMPE_Pos                   26                                             /**< (ADC_IDR) Comparison Event Interrupt Disable Position */
#define ADC_IDR_COMPE_Msk                   (_U_(0x1) << ADC_IDR_COMPE_Pos)                /**< (ADC_IDR) Comparison Event Interrupt Disable Mask */
#define ADC_IDR_COMPE                       ADC_IDR_COMPE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_COMPE_Msk instead */
#define ADC_IDR_ENDRX_Pos                   27                                             /**< (ADC_IDR) End of Receive Buffer Interrupt Disable Position */
#define ADC_IDR_ENDRX_Msk                   (_U_(0x1) << ADC_IDR_ENDRX_Pos)                /**< (ADC_IDR) End of Receive Buffer Interrupt Disable Mask */
#define ADC_IDR_ENDRX                       ADC_IDR_ENDRX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_ENDRX_Msk instead */
#define ADC_IDR_RXBUFF_Pos                  28                                             /**< (ADC_IDR) Receive Buffer Full Interrupt Disable Position */
#define ADC_IDR_RXBUFF_Msk                  (_U_(0x1) << ADC_IDR_RXBUFF_Pos)               /**< (ADC_IDR) Receive Buffer Full Interrupt Disable Mask */
#define ADC_IDR_RXBUFF                      ADC_IDR_RXBUFF_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IDR_RXBUFF_Msk instead */
#define ADC_IDR_MASK                        _U_(0x1F0800FF)                                /**< \deprecated (ADC_IDR) Register MASK  (Use ADC_IDR_Msk instead)  */
#define ADC_IDR_Msk                         _U_(0x1F0800FF)                                /**< (ADC_IDR) Register Mask  */

#define ADC_IDR_EOC_Pos                     0                                              /**< (ADC_IDR Position) End of Conversion Interrupt Disable x */
#define ADC_IDR_EOC_Msk                     (_U_(0xFF) << ADC_IDR_EOC_Pos)                 /**< (ADC_IDR Mask) EOC */
#define ADC_IDR_EOC(value)                  (ADC_IDR_EOC_Msk & ((value) << ADC_IDR_EOC_Pos))  

/* -------- ADC_IMR : (ADC Offset: 0x2c) (R/ 32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion Interrupt Mask 0       */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion Interrupt Mask 1       */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion Interrupt Mask 2       */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion Interrupt Mask 3       */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion Interrupt Mask 4       */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion Interrupt Mask 5       */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion Interrupt Mask 6       */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion Interrupt Mask 7       */
    uint32_t :11;                       /**< bit:  8..18  Reserved */
    uint32_t LCCHG:1;                   /**< bit:     19  Last Channel Change Interrupt Mask       */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Mask                */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error Interrupt Mask     */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Event Interrupt Mask          */
    uint32_t ENDRX:1;                   /**< bit:     27  End of Receive Buffer Interrupt Mask     */
    uint32_t RXBUFF:1;                  /**< bit:     28  Receive Buffer Full Interrupt Mask       */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t EOC:8;                     /**< bit:   0..7  End of Conversion Interrupt Mask x       */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} ADC_IMR_Type;
