ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_IMR_OFFSET                      (0x2C)                                        /**<  (ADC_IMR) Interrupt Mask Register  Offset */

#define ADC_IMR_EOC0_Pos                    0                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 0 Position */
#define ADC_IMR_EOC0_Msk                    (_U_(0x1) << ADC_IMR_EOC0_Pos)                 /**< (ADC_IMR) End of Conversion Interrupt Mask 0 Mask */
#define ADC_IMR_EOC0                        ADC_IMR_EOC0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_EOC0_Msk instead */
#define ADC_IMR_EOC1_Pos                    1                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 1 Position */
#define ADC_IMR_EOC1_Msk                    (_U_(0x1) << ADC_IMR_EOC1_Pos)                 /**< (ADC_IMR) End of Conversion Interrupt Mask 1 Mask */
#define ADC_IMR_EOC1                        ADC_IMR_EOC1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_EOC1_Msk instead */
#define ADC_IMR_EOC2_Pos                    2                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 2 Position */
#define ADC_IMR_EOC2_Msk                    (_U_(0x1) << ADC_IMR_EOC2_Pos)                 /**< (ADC_IMR) End of Conversion Interrupt Mask 2 Mask */
#define ADC_IMR_EOC2                        ADC_IMR_EOC2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_EOC2_Msk instead */
#define ADC_IMR_EOC3_Pos                    3                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 3 Position */
#define ADC_IMR_EOC3_Msk                    (_U_(0x1) << ADC_IMR_EOC3_Pos)                 /**< (ADC_IMR) End of Conversion Interrupt Mask 3 Mask */
#define ADC_IMR_EOC3                        ADC_IMR_EOC3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_EOC3_Msk instead */
#define ADC_IMR_EOC4_Pos                    4                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 4 Position */
#define ADC_IMR_EOC4_Msk                    (_U_(0x1) << ADC_IMR_EOC4_Pos)                 /**< (ADC_IMR) End of Conversion Interrupt Mask 4 Mask */
#define ADC_IMR_EOC4                        ADC_IMR_EOC4_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_EOC4_Msk instead */
#define ADC_IMR_EOC5_Pos                    5                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 5 Position */
#define ADC_IMR_EOC5_Msk                    (_U_(0x1) << ADC_IMR_EOC5_Pos)                 /**< (ADC_IMR) End of Conversion Interrupt Mask 5 Mask */
#define ADC_IMR_EOC5                        ADC_IMR_EOC5_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_EOC5_Msk instead */
#define ADC_IMR_EOC6_Pos                    6                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 6 Position */
#define ADC_IMR_EOC6_Msk                    (_U_(0x1) << ADC_IMR_EOC6_Pos)                 /**< (ADC_IMR) End of Conversion Interrupt Mask 6 Mask */
#define ADC_IMR_EOC6                        ADC_IMR_EOC6_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_EOC6_Msk instead */
#define ADC_IMR_EOC7_Pos                    7                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 7 Position */
#define ADC_IMR_EOC7_Msk                    (_U_(0x1) << ADC_IMR_EOC7_Pos)                 /**< (ADC_IMR) End of Conversion Interrupt Mask 7 Mask */
#define ADC_IMR_EOC7                        ADC_IMR_EOC7_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_EOC7_Msk instead */
#define ADC_IMR_LCCHG_Pos                   19                                             /**< (ADC_IMR) Last Channel Change Interrupt Mask Position */
#define ADC_IMR_LCCHG_Msk                   (_U_(0x1) << ADC_IMR_LCCHG_Pos)                /**< (ADC_IMR) Last Channel Change Interrupt Mask Mask */
#define ADC_IMR_LCCHG                       ADC_IMR_LCCHG_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_LCCHG_Msk instead */
#define ADC_IMR_DRDY_Pos                    24                                             /**< (ADC_IMR) Data Ready Interrupt Mask Position */
#define ADC_IMR_DRDY_Msk                    (_U_(0x1) << ADC_IMR_DRDY_Pos)                 /**< (ADC_IMR) Data Ready Interrupt Mask Mask */
#define ADC_IMR_DRDY                        ADC_IMR_DRDY_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_DRDY_Msk instead */
#define ADC_IMR_GOVRE_Pos                   25                                             /**< (ADC_IMR) General Overrun Error Interrupt Mask Position */
#define ADC_IMR_GOVRE_Msk                   (_U_(0x1) << ADC_IMR_GOVRE_Pos)                /**< (ADC_IMR) General Overrun Error Interrupt Mask Mask */
#define ADC_IMR_GOVRE                       ADC_IMR_GOVRE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_GOVRE_Msk instead */
#define ADC_IMR_COMPE_Pos                   26                                             /**< (ADC_IMR) Comparison Event Interrupt Mask Position */
#define ADC_IMR_COMPE_Msk                   (_U_(0x1) << ADC_IMR_COMPE_Pos)                /**< (ADC_IMR) Comparison Event Interrupt Mask Mask */
#define ADC_IMR_COMPE                       ADC_IMR_COMPE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_COMPE_Msk instead */
#define ADC_IMR_ENDRX_Pos                   27                                             /**< (ADC_IMR) End of Receive Buffer Interrupt Mask Position */
#define ADC_IMR_ENDRX_Msk                   (_U_(0x1) << ADC_IMR_ENDRX_Pos)                /**< (ADC_IMR) End of Receive Buffer Interrupt Mask Mask */
#define ADC_IMR_ENDRX                       ADC_IMR_ENDRX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_ENDRX_Msk instead */
#define ADC_IMR_RXBUFF_Pos                  28                                             /**< (ADC_IMR) Receive Buffer Full Interrupt Mask Position */
#define ADC_IMR_RXBUFF_Msk                  (_U_(0x1) << ADC_IMR_RXBUFF_Pos)               /**< (ADC_IMR) Receive Buffer Full Interrupt Mask Mask */
#define ADC_IMR_RXBUFF                      ADC_IMR_RXBUFF_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_IMR_RXBUFF_Msk instead */
#define ADC_IMR_MASK                        _U_(0x1F0800FF)                                /**< \deprecated (ADC_IMR) Register MASK  (Use ADC_IMR_Msk instead)  */
#define ADC_IMR_Msk                         _U_(0x1F0800FF)                                /**< (ADC_IMR) Register Mask  */

#define ADC_IMR_EOC_Pos                     0                                              /**< (ADC_IMR Position) End of Conversion Interrupt Mask x */
#define ADC_IMR_EOC_Msk                     (_U_(0xFF) << ADC_IMR_EOC_Pos)                 /**< (ADC_IMR Mask) EOC */
#define ADC_IMR_EOC(value)                  (ADC_IMR_EOC_Msk & ((value) << ADC_IMR_EOC_Pos))  

/* -------- ADC_ISR : (ADC Offset: 0x30) (R/ 32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion 0 (automatically set / cleared) */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion 1 (automatically set / cleared) */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion 2 (automatically set / cleared) */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion 3 (automatically set / cleared) */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion 4 (automatically set / cleared) */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion 5 (automatically set / cleared) */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion 6 (automatically set / cleared) */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion 7 (automatically set / cleared) */
    uint32_t :11;                       /**< bit:  8..18  Reserved */
    uint32_t LCCHG:1;                   /**< bit:     19  Last Channel Change (cleared on read)    */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready (automatically set / cleared) */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error (cleared on read)  */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Event (cleared on read)       */
    uint32_t ENDRX:1;                   /**< bit:     27  End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR) */
    uint32_t RXBUFF:1;                  /**< bit:     28  Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR) */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t EOC:8;                     /**< bit:   0..7  End of Conversion x (automatically set / cleared) */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} ADC_ISR_Type;
