ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_ISR_OFFSET                      (0x30)                                        /**<  (ADC_ISR) Interrupt Status Register  Offset */

#define ADC_ISR_EOC0_Pos                    0                                              /**< (ADC_ISR) End of Conversion 0 (automatically set / cleared) Position */
#define ADC_ISR_EOC0_Msk                    (_U_(0x1) << ADC_ISR_EOC0_Pos)                 /**< (ADC_ISR) End of Conversion 0 (automatically set / cleared) Mask */
#define ADC_ISR_EOC0                        ADC_ISR_EOC0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_EOC0_Msk instead */
#define ADC_ISR_EOC1_Pos                    1                                              /**< (ADC_ISR) End of Conversion 1 (automatically set / cleared) Position */
#define ADC_ISR_EOC1_Msk                    (_U_(0x1) << ADC_ISR_EOC1_Pos)                 /**< (ADC_ISR) End of Conversion 1 (automatically set / cleared) Mask */
#define ADC_ISR_EOC1                        ADC_ISR_EOC1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_EOC1_Msk instead */
#define ADC_ISR_EOC2_Pos                    2                                              /**< (ADC_ISR) End of Conversion 2 (automatically set / cleared) Position */
#define ADC_ISR_EOC2_Msk                    (_U_(0x1) << ADC_ISR_EOC2_Pos)                 /**< (ADC_ISR) End of Conversion 2 (automatically set / cleared) Mask */
#define ADC_ISR_EOC2                        ADC_ISR_EOC2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_EOC2_Msk instead */
#define ADC_ISR_EOC3_Pos                    3                                              /**< (ADC_ISR) End of Conversion 3 (automatically set / cleared) Position */
#define ADC_ISR_EOC3_Msk                    (_U_(0x1) << ADC_ISR_EOC3_Pos)                 /**< (ADC_ISR) End of Conversion 3 (automatically set / cleared) Mask */
#define ADC_ISR_EOC3                        ADC_ISR_EOC3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_EOC3_Msk instead */
#define ADC_ISR_EOC4_Pos                    4                                              /**< (ADC_ISR) End of Conversion 4 (automatically set / cleared) Position */
#define ADC_ISR_EOC4_Msk                    (_U_(0x1) << ADC_ISR_EOC4_Pos)                 /**< (ADC_ISR) End of Conversion 4 (automatically set / cleared) Mask */
#define ADC_ISR_EOC4                        ADC_ISR_EOC4_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_EOC4_Msk instead */
#define ADC_ISR_EOC5_Pos                    5                                              /**< (ADC_ISR) End of Conversion 5 (automatically set / cleared) Position */
#define ADC_ISR_EOC5_Msk                    (_U_(0x1) << ADC_ISR_EOC5_Pos)                 /**< (ADC_ISR) End of Conversion 5 (automatically set / cleared) Mask */
#define ADC_ISR_EOC5                        ADC_ISR_EOC5_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_EOC5_Msk instead */
#define ADC_ISR_EOC6_Pos                    6                                              /**< (ADC_ISR) End of Conversion 6 (automatically set / cleared) Position */
#define ADC_ISR_EOC6_Msk                    (_U_(0x1) << ADC_ISR_EOC6_Pos)                 /**< (ADC_ISR) End of Conversion 6 (automatically set / cleared) Mask */
#define ADC_ISR_EOC6                        ADC_ISR_EOC6_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_EOC6_Msk instead */
#define ADC_ISR_EOC7_Pos                    7                                              /**< (ADC_ISR) End of Conversion 7 (automatically set / cleared) Position */
#define ADC_ISR_EOC7_Msk                    (_U_(0x1) << ADC_ISR_EOC7_Pos)                 /**< (ADC_ISR) End of Conversion 7 (automatically set / cleared) Mask */
#define ADC_ISR_EOC7                        ADC_ISR_EOC7_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_EOC7_Msk instead */
#define ADC_ISR_LCCHG_Pos                   19                                             /**< (ADC_ISR) Last Channel Change (cleared on read) Position */
#define ADC_ISR_LCCHG_Msk                   (_U_(0x1) << ADC_ISR_LCCHG_Pos)                /**< (ADC_ISR) Last Channel Change (cleared on read) Mask */
#define ADC_ISR_LCCHG                       ADC_ISR_LCCHG_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_LCCHG_Msk instead */
#define ADC_ISR_DRDY_Pos                    24                                             /**< (ADC_ISR) Data Ready (automatically set / cleared) Position */
#define ADC_ISR_DRDY_Msk                    (_U_(0x1) << ADC_ISR_DRDY_Pos)                 /**< (ADC_ISR) Data Ready (automatically set / cleared) Mask */
#define ADC_ISR_DRDY                        ADC_ISR_DRDY_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_DRDY_Msk instead */
#define ADC_ISR_GOVRE_Pos                   25                                             /**< (ADC_ISR) General Overrun Error (cleared on read) Position */
#define ADC_ISR_GOVRE_Msk                   (_U_(0x1) << ADC_ISR_GOVRE_Pos)                /**< (ADC_ISR) General Overrun Error (cleared on read) Mask */
#define ADC_ISR_GOVRE                       ADC_ISR_GOVRE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_GOVRE_Msk instead */
#define ADC_ISR_COMPE_Pos                   26                                             /**< (ADC_ISR) Comparison Event (cleared on read) Position */
#define ADC_ISR_COMPE_Msk                   (_U_(0x1) << ADC_ISR_COMPE_Pos)                /**< (ADC_ISR) Comparison Event (cleared on read) Mask */
#define ADC_ISR_COMPE                       ADC_ISR_COMPE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_COMPE_Msk instead */
#define ADC_ISR_ENDRX_Pos                   27                                             /**< (ADC_ISR) End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR) Position */
#define ADC_ISR_ENDRX_Msk                   (_U_(0x1) << ADC_ISR_ENDRX_Pos)                /**< (ADC_ISR) End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR) Mask */
#define ADC_ISR_ENDRX                       ADC_ISR_ENDRX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_ENDRX_Msk instead */
#define ADC_ISR_RXBUFF_Pos                  28                                             /**< (ADC_ISR) Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR) Position */
#define ADC_ISR_RXBUFF_Msk                  (_U_(0x1) << ADC_ISR_RXBUFF_Pos)               /**< (ADC_ISR) Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR) Mask */
#define ADC_ISR_RXBUFF                      ADC_ISR_RXBUFF_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_ISR_RXBUFF_Msk instead */
#define ADC_ISR_MASK                        _U_(0x1F0800FF)                                /**< \deprecated (ADC_ISR) Register MASK  (Use ADC_ISR_Msk instead)  */
#define ADC_ISR_Msk                         _U_(0x1F0800FF)                                /**< (ADC_ISR) Register Mask  */

