ataradov/mcu-starter-projects/samg53/include/component/adc.h
#define ADC_ISR_EOC_Pos                     0                                              /**< (ADC_ISR Position) End of Conversion x (automatically set / cleared) */
#define ADC_ISR_EOC_Msk                     (_U_(0xFF) << ADC_ISR_EOC_Pos)                 /**< (ADC_ISR Mask) EOC */
#define ADC_ISR_EOC(value)                  (ADC_ISR_EOC_Msk & ((value) << ADC_ISR_EOC_Pos))  

/* -------- ADC_LCTMR : (ADC Offset: 0x34) (R/W 32) Last Channel Trigger Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DUALTRIG:1;                /**< bit:      0  Dual Trigger ON                          */
    uint32_t :3;                        /**< bit:   1..3  Reserved */
    uint32_t CMPMOD:2;                  /**< bit:   4..5  Last Channel Comparison Mode             */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_LCTMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_LCTMR_OFFSET                    (0x34)                                        /**<  (ADC_LCTMR) Last Channel Trigger Mode Register  Offset */

#define ADC_LCTMR_DUALTRIG_Pos              0                                              /**< (ADC_LCTMR) Dual Trigger ON Position */
#define ADC_LCTMR_DUALTRIG_Msk              (_U_(0x1) << ADC_LCTMR_DUALTRIG_Pos)           /**< (ADC_LCTMR) Dual Trigger ON Mask */
#define ADC_LCTMR_DUALTRIG                  ADC_LCTMR_DUALTRIG_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_LCTMR_DUALTRIG_Msk instead */
#define ADC_LCTMR_CMPMOD_Pos                4                                              /**< (ADC_LCTMR) Last Channel Comparison Mode Position */
#define ADC_LCTMR_CMPMOD_Msk                (_U_(0x3) << ADC_LCTMR_CMPMOD_Pos)             /**< (ADC_LCTMR) Last Channel Comparison Mode Mask */
#define ADC_LCTMR_CMPMOD(value)             (ADC_LCTMR_CMPMOD_Msk & ((value) << ADC_LCTMR_CMPMOD_Pos))
#define   ADC_LCTMR_CMPMOD_LOW_Val          _U_(0x0)                                       /**< (ADC_LCTMR) Generates an event when the converted data is lower than the low threshold of the window.  */
#define   ADC_LCTMR_CMPMOD_HIGH_Val         _U_(0x1)                                       /**< (ADC_LCTMR) Generates an event when the converted data is higher than the high threshold of the window.  */
#define   ADC_LCTMR_CMPMOD_IN_Val           _U_(0x2)                                       /**< (ADC_LCTMR) Generates an event when the converted data is in the comparison window.  */
#define   ADC_LCTMR_CMPMOD_OUT_Val          _U_(0x3)                                       /**< (ADC_LCTMR) Generates an event when the converted data is out of the comparison window.  */
#define ADC_LCTMR_CMPMOD_LOW                (ADC_LCTMR_CMPMOD_LOW_Val << ADC_LCTMR_CMPMOD_Pos)  /**< (ADC_LCTMR) Generates an event when the converted data is lower than the low threshold of the window. Position  */
#define ADC_LCTMR_CMPMOD_HIGH               (ADC_LCTMR_CMPMOD_HIGH_Val << ADC_LCTMR_CMPMOD_Pos)  /**< (ADC_LCTMR) Generates an event when the converted data is higher than the high threshold of the window. Position  */
#define ADC_LCTMR_CMPMOD_IN                 (ADC_LCTMR_CMPMOD_IN_Val << ADC_LCTMR_CMPMOD_Pos)  /**< (ADC_LCTMR) Generates an event when the converted data is in the comparison window. Position  */
#define ADC_LCTMR_CMPMOD_OUT                (ADC_LCTMR_CMPMOD_OUT_Val << ADC_LCTMR_CMPMOD_Pos)  /**< (ADC_LCTMR) Generates an event when the converted data is out of the comparison window. Position  */
#define ADC_LCTMR_MASK                      _U_(0x31)                                      /**< \deprecated (ADC_LCTMR) Register MASK  (Use ADC_LCTMR_Msk instead)  */
#define ADC_LCTMR_Msk                       _U_(0x31)                                      /**< (ADC_LCTMR) Register Mask  */


/* -------- ADC_LCCWR : (ADC Offset: 0x38) (R/W 32) Last Channel Compare Window Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LOWTHRES:12;               /**< bit:  0..11  Low Threshold                            */
    uint32_t :4;                        /**< bit: 12..15  Reserved */
    uint32_t HIGHTHRES:12;              /**< bit: 16..27  High Threshold                           */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_LCCWR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_LCCWR_OFFSET                    (0x38)                                        /**<  (ADC_LCCWR) Last Channel Compare Window Register  Offset */

#define ADC_LCCWR_LOWTHRES_Pos              0                                              /**< (ADC_LCCWR) Low Threshold Position */
#define ADC_LCCWR_LOWTHRES_Msk              (_U_(0xFFF) << ADC_LCCWR_LOWTHRES_Pos)         /**< (ADC_LCCWR) Low Threshold Mask */
#define ADC_LCCWR_LOWTHRES(value)           (ADC_LCCWR_LOWTHRES_Msk & ((value) << ADC_LCCWR_LOWTHRES_Pos))
#define ADC_LCCWR_HIGHTHRES_Pos             16                                             /**< (ADC_LCCWR) High Threshold Position */
#define ADC_LCCWR_HIGHTHRES_Msk             (_U_(0xFFF) << ADC_LCCWR_HIGHTHRES_Pos)        /**< (ADC_LCCWR) High Threshold Mask */
#define ADC_LCCWR_HIGHTHRES(value)          (ADC_LCCWR_HIGHTHRES_Msk & ((value) << ADC_LCCWR_HIGHTHRES_Pos))
#define ADC_LCCWR_MASK                      _U_(0xFFF0FFF)                                 /**< \deprecated (ADC_LCCWR) Register MASK  (Use ADC_LCCWR_Msk instead)  */
#define ADC_LCCWR_Msk                       _U_(0xFFF0FFF)                                 /**< (ADC_LCCWR) Register Mask  */


/* -------- ADC_OVER : (ADC Offset: 0x3c) (R/ 32) Overrun Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t OVRE0:1;                   /**< bit:      0  Overrun Error 0                          */
    uint32_t OVRE1:1;                   /**< bit:      1  Overrun Error 1                          */
    uint32_t OVRE2:1;                   /**< bit:      2  Overrun Error 2                          */
    uint32_t OVRE3:1;                   /**< bit:      3  Overrun Error 3                          */
    uint32_t OVRE4:1;                   /**< bit:      4  Overrun Error 4                          */
    uint32_t OVRE5:1;                   /**< bit:      5  Overrun Error 5                          */
    uint32_t OVRE6:1;                   /**< bit:      6  Overrun Error 6                          */
    uint32_t OVRE7:1;                   /**< bit:      7  Overrun Error 7                          */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t OVRE:8;                    /**< bit:   0..7  Overrun Error 7                          */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} ADC_OVER_Type;
