ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_OVER_OFFSET                     (0x3C)                                        /**<  (ADC_OVER) Overrun Status Register  Offset */

#define ADC_OVER_OVRE0_Pos                  0                                              /**< (ADC_OVER) Overrun Error 0 Position */
#define ADC_OVER_OVRE0_Msk                  (_U_(0x1) << ADC_OVER_OVRE0_Pos)               /**< (ADC_OVER) Overrun Error 0 Mask */
#define ADC_OVER_OVRE0                      ADC_OVER_OVRE0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_OVER_OVRE0_Msk instead */
#define ADC_OVER_OVRE1_Pos                  1                                              /**< (ADC_OVER) Overrun Error 1 Position */
#define ADC_OVER_OVRE1_Msk                  (_U_(0x1) << ADC_OVER_OVRE1_Pos)               /**< (ADC_OVER) Overrun Error 1 Mask */
#define ADC_OVER_OVRE1                      ADC_OVER_OVRE1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_OVER_OVRE1_Msk instead */
#define ADC_OVER_OVRE2_Pos                  2                                              /**< (ADC_OVER) Overrun Error 2 Position */
#define ADC_OVER_OVRE2_Msk                  (_U_(0x1) << ADC_OVER_OVRE2_Pos)               /**< (ADC_OVER) Overrun Error 2 Mask */
#define ADC_OVER_OVRE2                      ADC_OVER_OVRE2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_OVER_OVRE2_Msk instead */
#define ADC_OVER_OVRE3_Pos                  3                                              /**< (ADC_OVER) Overrun Error 3 Position */
#define ADC_OVER_OVRE3_Msk                  (_U_(0x1) << ADC_OVER_OVRE3_Pos)               /**< (ADC_OVER) Overrun Error 3 Mask */
#define ADC_OVER_OVRE3                      ADC_OVER_OVRE3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_OVER_OVRE3_Msk instead */
#define ADC_OVER_OVRE4_Pos                  4                                              /**< (ADC_OVER) Overrun Error 4 Position */
#define ADC_OVER_OVRE4_Msk                  (_U_(0x1) << ADC_OVER_OVRE4_Pos)               /**< (ADC_OVER) Overrun Error 4 Mask */
#define ADC_OVER_OVRE4                      ADC_OVER_OVRE4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_OVER_OVRE4_Msk instead */
#define ADC_OVER_OVRE5_Pos                  5                                              /**< (ADC_OVER) Overrun Error 5 Position */
#define ADC_OVER_OVRE5_Msk                  (_U_(0x1) << ADC_OVER_OVRE5_Pos)               /**< (ADC_OVER) Overrun Error 5 Mask */
#define ADC_OVER_OVRE5                      ADC_OVER_OVRE5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_OVER_OVRE5_Msk instead */
#define ADC_OVER_OVRE6_Pos                  6                                              /**< (ADC_OVER) Overrun Error 6 Position */
#define ADC_OVER_OVRE6_Msk                  (_U_(0x1) << ADC_OVER_OVRE6_Pos)               /**< (ADC_OVER) Overrun Error 6 Mask */
#define ADC_OVER_OVRE6                      ADC_OVER_OVRE6_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_OVER_OVRE6_Msk instead */
#define ADC_OVER_OVRE7_Pos                  7                                              /**< (ADC_OVER) Overrun Error 7 Position */
#define ADC_OVER_OVRE7_Msk                  (_U_(0x1) << ADC_OVER_OVRE7_Pos)               /**< (ADC_OVER) Overrun Error 7 Mask */
#define ADC_OVER_OVRE7                      ADC_OVER_OVRE7_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_OVER_OVRE7_Msk instead */
#define ADC_OVER_MASK                       _U_(0xFF)                                      /**< \deprecated (ADC_OVER) Register MASK  (Use ADC_OVER_Msk instead)  */
#define ADC_OVER_Msk                        _U_(0xFF)                                      /**< (ADC_OVER) Register Mask  */

#define ADC_OVER_OVRE_Pos                   0                                              /**< (ADC_OVER Position) Overrun Error 7 */
#define ADC_OVER_OVRE_Msk                   (_U_(0xFF) << ADC_OVER_OVRE_Pos)               /**< (ADC_OVER Mask) OVRE */
#define ADC_OVER_OVRE(value)                (ADC_OVER_OVRE_Msk & ((value) << ADC_OVER_OVRE_Pos))  

/* -------- ADC_EMR : (ADC Offset: 0x40) (R/W 32) Extended Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CMPMODE:2;                 /**< bit:   0..1  Comparison Mode                          */
    uint32_t CMPTYPE:1;                 /**< bit:      2  Comparison Type                          */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t CMPSEL:4;                  /**< bit:   4..7  Comparison Selected Channel              */
    uint32_t :1;                        /**< bit:      8  Reserved */
    uint32_t CMPALL:1;                  /**< bit:      9  Compare All Channels                     */
    uint32_t :2;                        /**< bit: 10..11  Reserved */
    uint32_t CMPFILTER:2;               /**< bit: 12..13  Compare Event Filtering                  */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t OSR:2;                     /**< bit: 16..17  Over Sampling Rate                       */
    uint32_t :2;                        /**< bit: 18..19  Reserved */
    uint32_t ASTE:1;                    /**< bit:     20  Averaging on Single Trigger Event        */
    uint32_t SRCCLK:1;                  /**< bit:     21  External Clock Selection                 */
    uint32_t :2;                        /**< bit: 22..23  Reserved */
    uint32_t TAG:1;                     /**< bit:     24  Tag of the ADC_LCDR                      */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_EMR_Type;
