ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_EMR_OFFSET                      (0x40)                                        /**<  (ADC_EMR) Extended Mode Register  Offset */

#define ADC_EMR_CMPMODE_Pos                 0                                              /**< (ADC_EMR) Comparison Mode Position */
#define ADC_EMR_CMPMODE_Msk                 (_U_(0x3) << ADC_EMR_CMPMODE_Pos)              /**< (ADC_EMR) Comparison Mode Mask */
#define ADC_EMR_CMPMODE(value)              (ADC_EMR_CMPMODE_Msk & ((value) << ADC_EMR_CMPMODE_Pos))
#define   ADC_EMR_CMPMODE_LOW_Val           _U_(0x0)                                       /**< (ADC_EMR) Generates an event when the converted data is lower than the low threshold of the window.  */
#define   ADC_EMR_CMPMODE_HIGH_Val          _U_(0x1)                                       /**< (ADC_EMR) Generates an event when the converted data is higher than the high threshold of the window.  */
#define   ADC_EMR_CMPMODE_IN_Val            _U_(0x2)                                       /**< (ADC_EMR) Generates an event when the converted data is in the comparison window.  */
#define   ADC_EMR_CMPMODE_OUT_Val           _U_(0x3)                                       /**< (ADC_EMR) Generates an event when the converted data is out of the comparison window.  */
#define ADC_EMR_CMPMODE_LOW                 (ADC_EMR_CMPMODE_LOW_Val << ADC_EMR_CMPMODE_Pos)  /**< (ADC_EMR) Generates an event when the converted data is lower than the low threshold of the window. Position  */
#define ADC_EMR_CMPMODE_HIGH                (ADC_EMR_CMPMODE_HIGH_Val << ADC_EMR_CMPMODE_Pos)  /**< (ADC_EMR) Generates an event when the converted data is higher than the high threshold of the window. Position  */
#define ADC_EMR_CMPMODE_IN                  (ADC_EMR_CMPMODE_IN_Val << ADC_EMR_CMPMODE_Pos)  /**< (ADC_EMR) Generates an event when the converted data is in the comparison window. Position  */
#define ADC_EMR_CMPMODE_OUT                 (ADC_EMR_CMPMODE_OUT_Val << ADC_EMR_CMPMODE_Pos)  /**< (ADC_EMR) Generates an event when the converted data is out of the comparison window. Position  */
#define ADC_EMR_CMPTYPE_Pos                 2                                              /**< (ADC_EMR) Comparison Type Position */
#define ADC_EMR_CMPTYPE_Msk                 (_U_(0x1) << ADC_EMR_CMPTYPE_Pos)              /**< (ADC_EMR) Comparison Type Mask */
#define ADC_EMR_CMPTYPE                     ADC_EMR_CMPTYPE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_EMR_CMPTYPE_Msk instead */
#define   ADC_EMR_CMPTYPE_FLAG_ONLY_Val     _U_(0x0)                                       /**< (ADC_EMR) Any conversion is performed and comparison function drives the COMPE flag.  */
#define   ADC_EMR_CMPTYPE_START_CONDITION_Val _U_(0x1)                                       /**< (ADC_EMR) Comparison conditions must be met to start the storage of all conversions until the CMPRST bit is set.  */
#define ADC_EMR_CMPTYPE_FLAG_ONLY           (ADC_EMR_CMPTYPE_FLAG_ONLY_Val << ADC_EMR_CMPTYPE_Pos)  /**< (ADC_EMR) Any conversion is performed and comparison function drives the COMPE flag. Position  */
#define ADC_EMR_CMPTYPE_START_CONDITION     (ADC_EMR_CMPTYPE_START_CONDITION_Val << ADC_EMR_CMPTYPE_Pos)  /**< (ADC_EMR) Comparison conditions must be met to start the storage of all conversions until the CMPRST bit is set. Position  */
#define ADC_EMR_CMPSEL_Pos                  4                                              /**< (ADC_EMR) Comparison Selected Channel Position */
#define ADC_EMR_CMPSEL_Msk                  (_U_(0xF) << ADC_EMR_CMPSEL_Pos)               /**< (ADC_EMR) Comparison Selected Channel Mask */
#define ADC_EMR_CMPSEL(value)               (ADC_EMR_CMPSEL_Msk & ((value) << ADC_EMR_CMPSEL_Pos))
#define ADC_EMR_CMPALL_Pos                  9                                              /**< (ADC_EMR) Compare All Channels Position */
#define ADC_EMR_CMPALL_Msk                  (_U_(0x1) << ADC_EMR_CMPALL_Pos)               /**< (ADC_EMR) Compare All Channels Mask */
#define ADC_EMR_CMPALL                      ADC_EMR_CMPALL_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_EMR_CMPALL_Msk instead */
#define ADC_EMR_CMPFILTER_Pos               12                                             /**< (ADC_EMR) Compare Event Filtering Position */
#define ADC_EMR_CMPFILTER_Msk               (_U_(0x3) << ADC_EMR_CMPFILTER_Pos)            /**< (ADC_EMR) Compare Event Filtering Mask */
#define ADC_EMR_CMPFILTER(value)            (ADC_EMR_CMPFILTER_Msk & ((value) << ADC_EMR_CMPFILTER_Pos))
#define ADC_EMR_OSR_Pos                     16                                             /**< (ADC_EMR) Over Sampling Rate Position */
#define ADC_EMR_OSR_Msk                     (_U_(0x3) << ADC_EMR_OSR_Pos)                  /**< (ADC_EMR) Over Sampling Rate Mask */
#define ADC_EMR_OSR(value)                  (ADC_EMR_OSR_Msk & ((value) << ADC_EMR_OSR_Pos))
#define   ADC_EMR_OSR_NO_AVERAGE_Val        _U_(0x0)                                       /**< (ADC_EMR) No averaging. ADC sample rate is maximum.  */
#define   ADC_EMR_OSR_OSR4_Val              _U_(0x1)                                       /**< (ADC_EMR) 1-bit enhanced resolution by averaging. ADC sample rate divided by 4.  */
#define   ADC_EMR_OSR_OSR16_Val             _U_(0x2)                                       /**< (ADC_EMR) 2-bit enhanced resolution by averaging. ADC sample rate divided by 16.  */
#define ADC_EMR_OSR_NO_AVERAGE              (ADC_EMR_OSR_NO_AVERAGE_Val << ADC_EMR_OSR_Pos)  /**< (ADC_EMR) No averaging. ADC sample rate is maximum. Position  */
#define ADC_EMR_OSR_OSR4                    (ADC_EMR_OSR_OSR4_Val << ADC_EMR_OSR_Pos)      /**< (ADC_EMR) 1-bit enhanced resolution by averaging. ADC sample rate divided by 4. Position  */
#define ADC_EMR_OSR_OSR16                   (ADC_EMR_OSR_OSR16_Val << ADC_EMR_OSR_Pos)     /**< (ADC_EMR) 2-bit enhanced resolution by averaging. ADC sample rate divided by 16. Position  */
#define ADC_EMR_ASTE_Pos                    20                                             /**< (ADC_EMR) Averaging on Single Trigger Event Position */
#define ADC_EMR_ASTE_Msk                    (_U_(0x1) << ADC_EMR_ASTE_Pos)                 /**< (ADC_EMR) Averaging on Single Trigger Event Mask */
#define ADC_EMR_ASTE                        ADC_EMR_ASTE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_EMR_ASTE_Msk instead */
#define   ADC_EMR_ASTE_MULTI_TRIG_AVERAGE_Val _U_(0x0)                                       /**< (ADC_EMR) The average requests several trigger events.  */
#define   ADC_EMR_ASTE_SINGLE_TRIG_AVERAGE_Val _U_(0x1)                                       /**< (ADC_EMR) The average requests only one trigger event.  */
#define ADC_EMR_ASTE_MULTI_TRIG_AVERAGE     (ADC_EMR_ASTE_MULTI_TRIG_AVERAGE_Val << ADC_EMR_ASTE_Pos)  /**< (ADC_EMR) The average requests several trigger events. Position  */
#define ADC_EMR_ASTE_SINGLE_TRIG_AVERAGE    (ADC_EMR_ASTE_SINGLE_TRIG_AVERAGE_Val << ADC_EMR_ASTE_Pos)  /**< (ADC_EMR) The average requests only one trigger event. Position  */
#define ADC_EMR_SRCCLK_Pos                  21                                             /**< (ADC_EMR) External Clock Selection Position */
#define ADC_EMR_SRCCLK_Msk                  (_U_(0x1) << ADC_EMR_SRCCLK_Pos)               /**< (ADC_EMR) External Clock Selection Mask */
#define ADC_EMR_SRCCLK                      ADC_EMR_SRCCLK_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_EMR_SRCCLK_Msk instead */
#define   ADC_EMR_SRCCLK_PERIPH_CLK_Val     _U_(0x0)                                       /**< (ADC_EMR) The peripheral clock is the source for the ADC prescaler.  */
#define   ADC_EMR_SRCCLK_PMC_PCK_Val        _U_(0x1)                                       /**< (ADC_EMR) PMC PCKx is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock.  */
#define ADC_EMR_SRCCLK_PERIPH_CLK           (ADC_EMR_SRCCLK_PERIPH_CLK_Val << ADC_EMR_SRCCLK_Pos)  /**< (ADC_EMR) The peripheral clock is the source for the ADC prescaler. Position  */
#define ADC_EMR_SRCCLK_PMC_PCK              (ADC_EMR_SRCCLK_PMC_PCK_Val << ADC_EMR_SRCCLK_Pos)  /**< (ADC_EMR) PMC PCKx is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock. Position  */
#define ADC_EMR_TAG_Pos                     24                                             /**< (ADC_EMR) Tag of the ADC_LCDR Position */
#define ADC_EMR_TAG_Msk                     (_U_(0x1) << ADC_EMR_TAG_Pos)                  /**< (ADC_EMR) Tag of the ADC_LCDR Mask */
#define ADC_EMR_TAG                         ADC_EMR_TAG_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_EMR_TAG_Msk instead */
#define ADC_EMR_MASK                        _U_(0x13332F7)                                 /**< \deprecated (ADC_EMR) Register MASK  (Use ADC_EMR_Msk instead)  */
#define ADC_EMR_Msk                         _U_(0x13332F7)                                 /**< (ADC_EMR) Register Mask  */


/* -------- ADC_CWR : (ADC Offset: 0x44) (R/W 32) Compare Window Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LOWTHRES:12;               /**< bit:  0..11  Low Threshold                            */
    uint32_t :4;                        /**< bit: 12..15  Reserved */
    uint32_t HIGHTHRES:12;              /**< bit: 16..27  High Threshold                           */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_CWR_Type;
