ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_CWR_OFFSET                      (0x44)                                        /**<  (ADC_CWR) Compare Window Register  Offset */

#define ADC_CWR_LOWTHRES_Pos                0                                              /**< (ADC_CWR) Low Threshold Position */
#define ADC_CWR_LOWTHRES_Msk                (_U_(0xFFF) << ADC_CWR_LOWTHRES_Pos)           /**< (ADC_CWR) Low Threshold Mask */
#define ADC_CWR_LOWTHRES(value)             (ADC_CWR_LOWTHRES_Msk & ((value) << ADC_CWR_LOWTHRES_Pos))
#define ADC_CWR_HIGHTHRES_Pos               16                                             /**< (ADC_CWR) High Threshold Position */
#define ADC_CWR_HIGHTHRES_Msk               (_U_(0xFFF) << ADC_CWR_HIGHTHRES_Pos)          /**< (ADC_CWR) High Threshold Mask */
#define ADC_CWR_HIGHTHRES(value)            (ADC_CWR_HIGHTHRES_Msk & ((value) << ADC_CWR_HIGHTHRES_Pos))
#define ADC_CWR_MASK                        _U_(0xFFF0FFF)                                 /**< \deprecated (ADC_CWR) Register MASK  (Use ADC_CWR_Msk instead)  */
#define ADC_CWR_Msk                         _U_(0xFFF0FFF)                                 /**< (ADC_CWR) Register Mask  */


/* -------- ADC_CDR : (ADC Offset: 0x50) (R/ 32) Channel Data Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DATA:12;                   /**< bit:  0..11  Converted Data                           */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_CDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_CDR_OFFSET                      (0x50)                                        /**<  (ADC_CDR) Channel Data Register 0  Offset */

#define ADC_CDR_DATA_Pos                    0                                              /**< (ADC_CDR) Converted Data Position */
#define ADC_CDR_DATA_Msk                    (_U_(0xFFF) << ADC_CDR_DATA_Pos)               /**< (ADC_CDR) Converted Data Mask */
#define ADC_CDR_DATA(value)                 (ADC_CDR_DATA_Msk & ((value) << ADC_CDR_DATA_Pos))
#define ADC_CDR_MASK                        _U_(0xFFF)                                     /**< \deprecated (ADC_CDR) Register MASK  (Use ADC_CDR_Msk instead)  */
#define ADC_CDR_Msk                         _U_(0xFFF)                                     /**< (ADC_CDR) Register Mask  */


/* -------- ADC_WPMR : (ADC Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                  */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_WPMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_WPMR_OFFSET                     (0xE4)                                        /**<  (ADC_WPMR) Write Protection Mode Register  Offset */

#define ADC_WPMR_WPEN_Pos                   0                                              /**< (ADC_WPMR) Write Protection Enable Position */
#define ADC_WPMR_WPEN_Msk                   (_U_(0x1) << ADC_WPMR_WPEN_Pos)                /**< (ADC_WPMR) Write Protection Enable Mask */
#define ADC_WPMR_WPEN                       ADC_WPMR_WPEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_WPMR_WPEN_Msk instead */
#define ADC_WPMR_WPKEY_Pos                  8                                              /**< (ADC_WPMR) Write Protection Key Position */
#define ADC_WPMR_WPKEY_Msk                  (_U_(0xFFFFFF) << ADC_WPMR_WPKEY_Pos)          /**< (ADC_WPMR) Write Protection Key Mask */
#define ADC_WPMR_WPKEY(value)               (ADC_WPMR_WPKEY_Msk & ((value) << ADC_WPMR_WPKEY_Pos))
#define   ADC_WPMR_WPKEY_PASSWD_Val         _U_(0x414443)                                  /**< (ADC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0  */
#define ADC_WPMR_WPKEY_PASSWD               (ADC_WPMR_WPKEY_PASSWD_Val << ADC_WPMR_WPKEY_Pos)  /**< (ADC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0 Position  */
#define ADC_WPMR_MASK                       _U_(0xFFFFFF01)                                /**< \deprecated (ADC_WPMR) Register MASK  (Use ADC_WPMR_Msk instead)  */
#define ADC_WPMR_Msk                        _U_(0xFFFFFF01)                                /**< (ADC_WPMR) Register Mask  */


/* -------- ADC_WPSR : (ADC Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status        */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source        */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_WPSR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_WPSR_OFFSET                     (0xE8)                                        /**<  (ADC_WPSR) Write Protection Status Register  Offset */

#define ADC_WPSR_WPVS_Pos                   0                                              /**< (ADC_WPSR) Write Protection Violation Status Position */
#define ADC_WPSR_WPVS_Msk                   (_U_(0x1) << ADC_WPSR_WPVS_Pos)                /**< (ADC_WPSR) Write Protection Violation Status Mask */
#define ADC_WPSR_WPVS                       ADC_WPSR_WPVS_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_WPSR_WPVS_Msk instead */
#define ADC_WPSR_WPVSRC_Pos                 8                                              /**< (ADC_WPSR) Write Protection Violation Source Position */
#define ADC_WPSR_WPVSRC_Msk                 (_U_(0xFFFF) << ADC_WPSR_WPVSRC_Pos)           /**< (ADC_WPSR) Write Protection Violation Source Mask */
#define ADC_WPSR_WPVSRC(value)              (ADC_WPSR_WPVSRC_Msk & ((value) << ADC_WPSR_WPVSRC_Pos))
#define ADC_WPSR_MASK                       _U_(0xFFFF01)                                  /**< \deprecated (ADC_WPSR) Register MASK  (Use ADC_WPSR_Msk instead)  */
#define ADC_WPSR_Msk                        _U_(0xFFFF01)                                  /**< (ADC_WPSR) Register Mask  */


/* -------- ADC_RPR : (ADC Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXPTR:32;                  /**< bit:  0..31  Receive Pointer Register                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_RPR_Type;
