ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_RPR_OFFSET                      (0x100)                                       /**<  (ADC_RPR) Receive Pointer Register  Offset */

#define ADC_RPR_RXPTR_Pos                   0                                              /**< (ADC_RPR) Receive Pointer Register Position */
#define ADC_RPR_RXPTR_Msk                   (_U_(0xFFFFFFFF) << ADC_RPR_RXPTR_Pos)         /**< (ADC_RPR) Receive Pointer Register Mask */
#define ADC_RPR_RXPTR(value)                (ADC_RPR_RXPTR_Msk & ((value) << ADC_RPR_RXPTR_Pos))
#define ADC_RPR_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (ADC_RPR) Register MASK  (Use ADC_RPR_Msk instead)  */
#define ADC_RPR_Msk                         _U_(0xFFFFFFFF)                                /**< (ADC_RPR) Register Mask  */


/* -------- ADC_RCR : (ADC Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXCTR:16;                  /**< bit:  0..15  Receive Counter Register                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_RCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_RCR_OFFSET                      (0x104)                                       /**<  (ADC_RCR) Receive Counter Register  Offset */

#define ADC_RCR_RXCTR_Pos                   0                                              /**< (ADC_RCR) Receive Counter Register Position */
#define ADC_RCR_RXCTR_Msk                   (_U_(0xFFFF) << ADC_RCR_RXCTR_Pos)             /**< (ADC_RCR) Receive Counter Register Mask */
#define ADC_RCR_RXCTR(value)                (ADC_RCR_RXCTR_Msk & ((value) << ADC_RCR_RXCTR_Pos))
#define ADC_RCR_MASK                        _U_(0xFFFF)                                    /**< \deprecated (ADC_RCR) Register MASK  (Use ADC_RCR_Msk instead)  */
#define ADC_RCR_Msk                         _U_(0xFFFF)                                    /**< (ADC_RCR) Register Mask  */


/* -------- ADC_RNPR : (ADC Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_RNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_RNPR_OFFSET                     (0x110)                                       /**<  (ADC_RNPR) Receive Next Pointer Register  Offset */

#define ADC_RNPR_RXNPTR_Pos                 0                                              /**< (ADC_RNPR) Receive Next Pointer Position */
#define ADC_RNPR_RXNPTR_Msk                 (_U_(0xFFFFFFFF) << ADC_RNPR_RXNPTR_Pos)       /**< (ADC_RNPR) Receive Next Pointer Mask */
#define ADC_RNPR_RXNPTR(value)              (ADC_RNPR_RXNPTR_Msk & ((value) << ADC_RNPR_RXNPTR_Pos))
#define ADC_RNPR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (ADC_RNPR) Register MASK  (Use ADC_RNPR_Msk instead)  */
#define ADC_RNPR_Msk                        _U_(0xFFFFFFFF)                                /**< (ADC_RNPR) Register Mask  */


/* -------- ADC_RNCR : (ADC Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_RNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_RNCR_OFFSET                     (0x114)                                       /**<  (ADC_RNCR) Receive Next Counter Register  Offset */

#define ADC_RNCR_RXNCTR_Pos                 0                                              /**< (ADC_RNCR) Receive Next Counter Position */
#define ADC_RNCR_RXNCTR_Msk                 (_U_(0xFFFF) << ADC_RNCR_RXNCTR_Pos)           /**< (ADC_RNCR) Receive Next Counter Mask */
#define ADC_RNCR_RXNCTR(value)              (ADC_RNCR_RXNCTR_Msk & ((value) << ADC_RNCR_RXNCTR_Pos))
#define ADC_RNCR_MASK                       _U_(0xFFFF)                                    /**< \deprecated (ADC_RNCR) Register MASK  (Use ADC_RNCR_Msk instead)  */
#define ADC_RNCR_Msk                        _U_(0xFFFF)                                    /**< (ADC_RNCR) Register Mask  */


/* -------- ADC_PTCR : (ADC Offset: 0x120) (/W 32) Transfer Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t RXTDIS:1;                  /**< bit:      1  Receiver Transfer Disable                */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t TXTDIS:1;                  /**< bit:      9  Transmitter Transfer Disable             */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t RXCBDIS:1;                 /**< bit:     17  Receiver Circular Buffer Disable         */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t TXCBDIS:1;                 /**< bit:     19  Transmitter Circular Buffer Disable      */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t ERRCLR:1;                  /**< bit:     24  Transfer Bus Error Clear                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ADC_PTCR_Type;
