ataradov/mcu-starter-projects/samg53/include/component/adc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_PTSR_OFFSET                     (0x124)                                       /**<  (ADC_PTSR) Transfer Status Register  Offset */

#define ADC_PTSR_RXTEN_Pos                  0                                              /**< (ADC_PTSR) Receiver Transfer Enable Position */
#define ADC_PTSR_RXTEN_Msk                  (_U_(0x1) << ADC_PTSR_RXTEN_Pos)               /**< (ADC_PTSR) Receiver Transfer Enable Mask */
#define ADC_PTSR_RXTEN                      ADC_PTSR_RXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_PTSR_RXTEN_Msk instead */
#define ADC_PTSR_TXTEN_Pos                  8                                              /**< (ADC_PTSR) Transmitter Transfer Enable Position */
#define ADC_PTSR_TXTEN_Msk                  (_U_(0x1) << ADC_PTSR_TXTEN_Pos)               /**< (ADC_PTSR) Transmitter Transfer Enable Mask */
#define ADC_PTSR_TXTEN                      ADC_PTSR_TXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_PTSR_TXTEN_Msk instead */
#define ADC_PTSR_RXCBEN_Pos                 16                                             /**< (ADC_PTSR) Receiver Circular Buffer Enable Position */
#define ADC_PTSR_RXCBEN_Msk                 (_U_(0x1) << ADC_PTSR_RXCBEN_Pos)              /**< (ADC_PTSR) Receiver Circular Buffer Enable Mask */
#define ADC_PTSR_RXCBEN                     ADC_PTSR_RXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_PTSR_RXCBEN_Msk instead */
#define ADC_PTSR_TXCBEN_Pos                 18                                             /**< (ADC_PTSR) Transmitter Circular Buffer Enable Position */
#define ADC_PTSR_TXCBEN_Msk                 (_U_(0x1) << ADC_PTSR_TXCBEN_Pos)              /**< (ADC_PTSR) Transmitter Circular Buffer Enable Mask */
#define ADC_PTSR_TXCBEN                     ADC_PTSR_TXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_PTSR_TXCBEN_Msk instead */
#define ADC_PTSR_ERR_Pos                    24                                             /**< (ADC_PTSR) Transfer Bus Error Position */
#define ADC_PTSR_ERR_Msk                    (_U_(0x1) << ADC_PTSR_ERR_Pos)                 /**< (ADC_PTSR) Transfer Bus Error Mask */
#define ADC_PTSR_ERR                        ADC_PTSR_ERR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ADC_PTSR_ERR_Msk instead */
#define ADC_PTSR_MASK                       _U_(0x1050101)                                 /**< \deprecated (ADC_PTSR) Register MASK  (Use ADC_PTSR_Msk instead)  */
#define ADC_PTSR_Msk                        _U_(0x1050101)                                 /**< (ADC_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief ADC hardware registers */
typedef struct {  
  __O  uint32_t ADC_CR;         /**< (ADC Offset: 0x00) Control Register */
  __IO uint32_t ADC_MR;         /**< (ADC Offset: 0x04) Mode Register */
  __IO uint32_t ADC_SEQR1;      /**< (ADC Offset: 0x08) Channel Sequence Register 1 */
  RoReg8  Reserved1[0x4];
  __O  uint32_t ADC_CHER;       /**< (ADC Offset: 0x10) Channel Enable Register */
  __O  uint32_t ADC_CHDR;       /**< (ADC Offset: 0x14) Channel Disable Register */
  __I  uint32_t ADC_CHSR;       /**< (ADC Offset: 0x18) Channel Status Register */
  RoReg8  Reserved2[0x4];
  __I  uint32_t ADC_LCDR;       /**< (ADC Offset: 0x20) Last Converted Data Register */
  __O  uint32_t ADC_IER;        /**< (ADC Offset: 0x24) Interrupt Enable Register */
  __O  uint32_t ADC_IDR;        /**< (ADC Offset: 0x28) Interrupt Disable Register */
  __I  uint32_t ADC_IMR;        /**< (ADC Offset: 0x2C) Interrupt Mask Register */
  __I  uint32_t ADC_ISR;        /**< (ADC Offset: 0x30) Interrupt Status Register */
  __IO uint32_t ADC_LCTMR;      /**< (ADC Offset: 0x34) Last Channel Trigger Mode Register */
  __IO uint32_t ADC_LCCWR;      /**< (ADC Offset: 0x38) Last Channel Compare Window Register */
  __I  uint32_t ADC_OVER;       /**< (ADC Offset: 0x3C) Overrun Status Register */
  __IO uint32_t ADC_EMR;        /**< (ADC Offset: 0x40) Extended Mode Register */
  __IO uint32_t ADC_CWR;        /**< (ADC Offset: 0x44) Compare Window Register */
  RoReg8  Reserved3[0x8];
  __I  uint32_t ADC_CDR[8];     /**< (ADC Offset: 0x50) Channel Data Register 0 */
  RoReg8  Reserved4[0x74];
  __IO uint32_t ADC_WPMR;       /**< (ADC Offset: 0xE4) Write Protection Mode Register */
  __I  uint32_t ADC_WPSR;       /**< (ADC Offset: 0xE8) Write Protection Status Register */
  RoReg8  Reserved5[0x14];
  __IO uint32_t ADC_RPR;        /**< (ADC Offset: 0x100) Receive Pointer Register */
  __IO uint32_t ADC_RCR;        /**< (ADC Offset: 0x104) Receive Counter Register */
  RoReg8  Reserved6[0x8];
  __IO uint32_t ADC_RNPR;       /**< (ADC Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t ADC_RNCR;       /**< (ADC Offset: 0x114) Receive Next Counter Register */
  RoReg8  Reserved7[0x8];
  __O  uint32_t ADC_PTCR;       /**< (ADC Offset: 0x120) Transfer Control Register */
  __I  uint32_t ADC_PTSR;       /**< (ADC Offset: 0x124) Transfer Status Register */
} Adc;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief ADC hardware registers */
typedef struct {  
  __O  ADC_CR_Type                    ADC_CR;         /**< Offset: 0x00 ( /W  32) Control Register */
  __IO ADC_MR_Type                    ADC_MR;         /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO ADC_SEQR1_Type                 ADC_SEQR1;      /**< Offset: 0x08 (R/W  32) Channel Sequence Register 1 */
  __I  uint32_t                       Reserved1[1];
  __O  ADC_CHER_Type                  ADC_CHER;       /**< Offset: 0x10 ( /W  32) Channel Enable Register */
  __O  ADC_CHDR_Type                  ADC_CHDR;       /**< Offset: 0x14 ( /W  32) Channel Disable Register */
  __I  ADC_CHSR_Type                  ADC_CHSR;       /**< Offset: 0x18 (R/   32) Channel Status Register */
  __I  uint32_t                       Reserved2[1];
  __I  ADC_LCDR_Type                  ADC_LCDR;       /**< Offset: 0x20 (R/   32) Last Converted Data Register */
  __O  ADC_IER_Type                   ADC_IER;        /**< Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O  ADC_IDR_Type                   ADC_IDR;        /**< Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I  ADC_IMR_Type                   ADC_IMR;        /**< Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I  ADC_ISR_Type                   ADC_ISR;        /**< Offset: 0x30 (R/   32) Interrupt Status Register */
  __IO ADC_LCTMR_Type                 ADC_LCTMR;      /**< Offset: 0x34 (R/W  32) Last Channel Trigger Mode Register */
  __IO ADC_LCCWR_Type                 ADC_LCCWR;      /**< Offset: 0x38 (R/W  32) Last Channel Compare Window Register */
  __I  ADC_OVER_Type                  ADC_OVER;       /**< Offset: 0x3C (R/   32) Overrun Status Register */
  __IO ADC_EMR_Type                   ADC_EMR;        /**< Offset: 0x40 (R/W  32) Extended Mode Register */
  __IO ADC_CWR_Type                   ADC_CWR;        /**< Offset: 0x44 (R/W  32) Compare Window Register */
  __I  uint32_t                       Reserved3[2];
  __I  ADC_CDR_Type                   ADC_CDR[8];     /**< Offset: 0x50 (R/   32) Channel Data Register 0 */
  __I  uint32_t                       Reserved4[29];
  __IO ADC_WPMR_Type                  ADC_WPMR;       /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  ADC_WPSR_Type                  ADC_WPSR;       /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I  uint32_t                       Reserved5[5];
  __IO ADC_RPR_Type                   ADC_RPR;        /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO ADC_RCR_Type                   ADC_RCR;        /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __I  uint32_t                       Reserved6[2];
  __IO ADC_RNPR_Type                  ADC_RNPR;       /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO ADC_RNCR_Type                  ADC_RNCR;       /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __I  uint32_t                       Reserved7[2];
  __O  ADC_PTCR_Type                  ADC_PTCR;       /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I  ADC_PTSR_Type                  ADC_PTSR;       /**< Offset: 0x124 (R/   32) Transfer Status Register */
} Adc;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Analog-to-Digital Converter */

#endif /* _SAMG53_ADC_COMPONENT_H_ */
